local W = unpack((select(2, ...)))

W.Changelog[337] = {
	RELEASE_DATE = "2023/09/29",
	IMPORTANT = {
		["zhCN"] = {},
		["zhTW"] = {},
		["enUS"] = {},
		["koKR"] = {},
		["ruRU"] = {},
	},
	NEW = {
		["zhCN"] = {},
		["zhTW"] = {},
		["enUS"] = {},
		["koKR"] = {},
		["ruRU"] = {},
	},
	IMPROVEMENT = {
		["zhCN"] = {
			"[额外物品条] 更新物品列表.",
			"[世界地图] 预更新 10.2 版本的地图迷雾去除功能.",
		},
		["zhTW"] = {
			"[額外物品條] 更新物品列表.",
			"[世界地圖] 預更新 10.2 版本的地圖迷霧去除功能.",
		},
		["enUS"] = {
			"[Extra Item Bar] Update item list.",
			"[World Map] Pre-update the fog reveal of version 10.2.",
		},
		["koKR"] = {
			"[추가 아이템 바] 아이템 목록 업데이트.",
			"[월드 맵] 10.2 버전의 안개 표시를 미리 업데이트하십시오.",
		},
		["ruRU"] = {
			"[Дополнительная панель предметов] Обновление списка предметов.",
			"[Карта мира] Предварительное обновление отображения тумана версии 10.2.",
		},
	},
}
