local W = unpack((select(2, ...)))
W.Changelog[343] = {
	RELEASE_DATE = "2023/11/10",
	IMPORTANT = {
		["zhCN"] = {
			"QQ 1 群已达到人数上限, 新增 QQ 2 群: 948518444.",
			"吸收盾错误修复请等待 ElvUI 进行修复.",
			"部分玩家可能遇到无法点击 [显示消息] 的问题, 请暂时关闭 聊天文字 模块. 具体原因排查中.",
		},
		["zhTW"] = {
			"QQ 1 群已達到人數上限, 新增 QQ 2 群: 948518444.",
			"吸收盾錯誤修復請等待 ElvUI 進行修復.",
			"部分玩家可能遇到無法點擊 [顯示消息] 的問題, 請暫時關閉 聊天文字 模組. 具體原因排查中.",
		},
		["enUS"] = {
			"QQ support group 1 has reached the maximum number of member, please join QQ 2 support group: 948518444.",
			"Absorb shield error fix please wait for ElvUI to fix.",
			"Some players may encounter the problem of not being able to click [Show Message], please temporarily turn off the Chat Text module. Specific reasons are being investigated.",
		},
		["koKR"] = {
			"QQ 지원 그룹 1이 최대 회원 수에 도달했습니다. QQ 2 지원 그룹 : 948518444에 가입하십시오.",
			"흡수 방패 오류 수정은 ElvUI가 수정 할 때까지 기다려주십시오.",
			"일부 플레이어는 [메시지 표시]를 클릭 할 수없는 문제가 발생할 수 있습니다. 일시적으로 채팅 텍스트 모듈을 비활성화하십시오. 구체적인 이유가 조사 중입니다.",
		},
		["ruRU"] = {
			"Группа поддержки QQ 1 достигла максимального количества участников, присоединяйтесь к группе поддержки QQ 2: 948518444.",
			"Исправление ошибки поглощения щита, пожалуйста, дождитесь исправления ElvUI.",
			"Некоторые игроки могут столкнуться с проблемой невозможности нажатия [Показать сообщение], пожалуйста, временно отключите модуль текста чата. Конкретные причины расследуются.",
		},
	},
	NEW = {
		["zhCN"] = {
			"[事件追踪器] 新增了一个事件追踪器, 用于追踪超然盛放事件.",
			"[进度] 新增对 S3 钥石大师和钥石英雄的支持.",
			"[额外物品条] 新增 10.2 可开启物品. 感谢 mcc1",
			"[额外物品条] 新增 10.2 专业物品. 感谢 mcc1",
			"[套装] 鼠标提示中的套装信息现在替换为 10.2 套装信息.",
		},
		["zhTW"] = {
			"[事件追蹤器] 新增了一個事件追蹤器, 用於追蹤繁盛綻放事件.",
			"[進度] 新增對 S3 鑰石王和鑰石英雄的支援.",
			"[額外物品條] 新增 10.2 可開啟物品. 感謝 mcc1",
			"[額外物品條] 新增 10.2 專業物品. 感謝 mcc1",
			"[套裝] 滑鼠提示中的套裝資訊現在替換為 10.2 套裝資訊.",
		},
		["enUS"] = {
			"[Event Tracker] Added a new event tracker for tracking the Feast of Prosperity event.",
			"[Progression] Added support for Keystone Master S3 and Keystone Hero S3.",
			"[Extra Item Bar] Added 10.2 openable items. Thanks mcc1",
			"[Extra Item Bar] Added 10.2 profession items. Thanks mcc1",
			"[Tier Set] The tier set information in the tooltip is now replaced with 10.2 tier set items.",
		},
		["koKR"] = {
			"[이벤트 추적기] 번영의 축제 이벤트를 추적하는 새 이벤트 추적기가 추가되었습니다.",
			"[진행] 케이스톤 마스터 S3 및 케이스톤 히어로 S3를 지원하도록 추가되었습니다.",
			"[추가 아이템 바] 10.2 개봉 가능한 아이템이 추가되었습니다. 감사합니다 mcc1",
			"[추가 아이템 바] 10.2 전문가 아이템이 추가되었습니다. 감사합니다 mcc1",
			"[티어 세트] 툴팁의 티어 세트 정보가 이제 10.2 티어 세트 아이템으로 대체되었습니다.",
		},
		["ruRU"] = {
			"[Отслеживание событий] Добавлен новый отслеживатель событий для отслеживания события Пир процветания.",
			"[Прогресс] Добавлена поддержка Keystone Master S3 и Keystone Hero S3.",
			"[Дополнительная панель предметов] Добавлены открываемые предметы 10.2. Спасибо mcc1",
			"[Дополнительная панель предметов] Добавлены профессиональные предметы 10.2. Спасибо mcc1",
			"[Наборы] Информация о наборе во всплывающей подсказке теперь заменяется предметами набора 10.2.",
		},
	},
	IMPROVEMENT = {
		["zhCN"] = {
			"[聊天文字] 同步 ElvUI 最新代码.",
			"[聊天文字] 修复了一个可能造成死循环的错误.",
			"[美化外观] 修复 MDT 皮肤.",
		},
		["zhTW"] = {
			"[聊天文字] 同步 ElvUI 最新代碼.",
			"[聊天文字] 修復了一個可能造成死迴圈的錯誤.",
			"[美化外觀] 修復 MDT 皮膚.",
		},
		["enUS"] = {
			"[Chat Text] Synced with the latest code from ElvUI.",
			"[Chat Text] Fixed an error that could cause an infinite loop.",
			"[Skins] Fixed MDT skin.",
		},
		["koKR"] = {
			"[채팅 텍스트] ElvUI의 최신 코드와 동기화되었습니다.",
			"[채팅 텍스트] 무한 루프를 발생시킬 수있는 오류가 수정되었습니다.",
			"[스킨] MDT 스킨이 수정되었습니다.",
		},
		["ruRU"] = {
			"[Текст чата] Синхронизировано с последним кодом от ElvUI.",
			"[Текст чата] Исправлена ошибка, которая могла вызвать бесконечный цикл.",
			"[Скины] Исправлен скин MDT.",
		},
	},
}
