local W = unpack((select(2, ...))) ---@type WindTools

W.Changelog[365] = {
	RELEASE_DATE = "2024/08/17",
	IMPORTANT = {
		["zhCN"] = {
			"本地化文本更新。",
		},
		["zhTW"] = {
			"本地化文本更新。",
		},
		["enUS"] = {
			"Updated localization texts.",
		},
		["koKR"] = {
			"로컬라이징 텍스트가 업데이트되었습니다.",
		},
		["ruRU"] = {
			"Обновлены локализованные тексты.",
		},
	},
	NEW = {
		["zhCN"] = {
			"[其他] 新增了 [冷却文字偏移] 模块。",
			"[其他] 新增了 [自定义快捷键别名] 模块。",
			"[其他-标签] 新增了吸收盾相关的多个标签。",
		},
		["zhTW"] = {
			"[其他] 新增了 [冷卻文字偏移] 模組。",
			"[其他] 新增了 [自定義按鍵別名] 模組。",
			"[其他-標籤] 新增了吸收盾相關的多個標籤。",
		},
		["enUS"] = {
			"[Misc] Added [Cooldown Text Offset] module.",
			"[Misc] Added [Custom Keybind Alias] module.",
			"[Misc-Tag] Added multiple tags related to absorbs.",
		},
		["koKR"] = {
			"[기타] [재사용 대기시간 텍스트 오프셋] 모듈이 추가되었습니다.",
			"[기타] [사용자 지정 단축키 별칭] 모듈이 추가되었습니다.",
			"[기타-태그] 흡수 방패와 관련된 여러 태그가 추가되었습니다.",
		},
		["ruRU"] = {
			"[Разное] Добавлен модуль [Смещение текста восстановления].",
			"[Разное] Добавлен модуль [Пользовательские псевдонимы клавиш].",
			"[Разное-Теги] Добавлены несколько тегов, связанных с поглощающими щитами.",
		},
	},
	IMPROVEMENT = {
		["zhCN"] = {},
		["zhTW"] = {},
		["enUS"] = {},
		["koKR"] = {},
		["ruRU"] = {},
	},
}
