local W = unpack((select(2, ...)))

W.Changelog[367] = {
	RELEASE_DATE = "2024/08/20",
	IMPORTANT = {
		["zhCN"] = {
			"[鼠标提示] 优化鼠标提示的总体性能表现。",
		},
		["zhTW"] = {
			"[鼠標提示] 優化鼠標提示的總體性能表現。",
		},
		["enUS"] = {
			"[Tooltips] Optimized the overall performance of tooltips.",
		},
		["koKR"] = {
			"[툴팁] 툴팁의 전반적인 성능을 최적화했습니다.",
		},
		["ruRU"] = {
			"[Подсказки] Оптимизирована общая производительность всплывающих подсказок.",
		},
	},
	NEW = {
		["zhCN"] = {
			"[鼠标提示] 一般设定中新增装等强制显示功能。",
			"[鼠标提示] 一般设定中新增种族图标显示功能。",
			"[鼠标提示] 一般设定中新增专精图标显示功能。",
			"[鼠标提示] 一般设定中新增 M+ 信息增强功能。",
		},
		["zhTW"] = {
			"[鼠標提示] 一般設定中新增裝等強制顯示功能。",
			"[鼠標提示] 一般設定中新增種族圖示顯示功能。",
			"[鼠標提示] 一般設定中新增專精圖示顯示功能。",
			"[鼠標提示] 一般設定中新增 M+ 資訊增強功能。",
		},
		["enUS"] = {
			"[Tooltips] Added item level force display feature in general settings.",
			"[Tooltips] Added race icon display feature in general settings.",
			"[Tooltips] Added specialization icon display feature in general settings.",
			"[Tooltips] Added better M+ information feature in general settings.",
		},
		["koKR"] = {
			"[툴팁] 일반 설정에 아이템 레벨 강제 표시 기능 추가.",
			"[툴팁] 일반 설정에 종족 아이콘 표시 기능 추가.",
			"[툴팁] 일반 설정에 전문화 아이콘 표시 기능 추가.",
			"[툴팁] 일반 설정에 M+ 정보 개선 기능 추가.",
		},
		["ruRU"] = {
			"[Подсказки] Добавлена функция принудительного отображения уровня предмета в общих настройках.",
			"[Подсказки] Добавлена функция отображения иконки расы в общих настройках.",
			"[Подсказки] Добавлена функция отображения иконки специализации в общих настройках.",
			"[Подсказки] Добавлена функция улучшения информации о М+ в общих настройках.",
		},
	},
	IMPROVEMENT = {
		["zhCN"] = {
			"[光速拾取] 拾取失败时现在会发送到聊天面板而不是系统提示框架中。",
			"[进度] 第一次观察时不会再有成就面板被打开的声音。",
			"[进度] 优化了处理逻辑，现在大部分情况下能够在第一次观察时顺利展开信息了。",
			"[进度] 优化了显示文本，现在能够看到 M+ 记录的箱子数量了。",
			"[事件追踪器] 切换任务列表现在会自动触发面板宽度的更新了。",
			"[职业助手] 尝试修复的 DK 职业助手的问题。感谢 AngelosNaoumis",
		},
		["zhTW"] = {
			"[光速拾取] 拾取失敗時現在會發送到聊天面板而不是系統提示框架中。",
			"[進度] 第一次觀察時不會再有成就面板被打開的聲音。",
			"[進度] 優化了處理邏輯，現在大部分情況下能夠在第一次觀察時順利展開信息了。",
			"[進度] 優化了顯示文本，現在能夠看到 M+ 記錄的箱子數量了。",
			"[事件追踪器] 切換任務列表現在會自動觸發面板寬度的更新了。",
			"[職業助手] 嘗試修復的 DK 職業助手的問題。感謝 AngelosNaoumis",
		},
		["enUS"] = {
			"[Fast Loot] Failed looting now sends to chat frame instead of system error frame.",
			"[Progression] No longer plays achievement panel open sound on first observation.",
			"[Progression] Optimize the logic, now most of the time it will expand information smoothly on first observation.",
			"[Progression] Optimize the display text, now you can see the number of chests in M+ records.",
			"[Event Tracker] Switching quest log now automatically triggers panel width update.",
			"[Class Helper] Attempted to fix issues with DK tools. Thanks AngelosNaoumis",
		},
		["koKR"] = {
			"[빠른 룻] 룻 실패시 이제 시스템 오류 프레임이 아닌 채팅 프레임으로 전송됩니다.",
			"[진행] 첫 관찰 시 이제 업적 창이 열리는 소리가 나지 않습니다.",
			"[진행] 로직을 최적화하여 대부분의 경우 첫 관찰 시 정보가 원활하게 확장됩니다.",
			"[진행] 텍스트 표시를 최적화하여 이제 M+ 기록에서 상자 수를 볼 수 있습니다.",
			"[이벤트 추적기] 퀘스트 목록 전환은 이제 패널 너비 업데이트를 자동으로 트리거합니다.",
			"[직업 도우미] DK 도구의 문제를 수정하려고 시도했습니다. 충성: AngelosNaoumis",
		},
		["ruRU"] = {
			"[Быстрая добыча] При неудачной добыче теперь отправляется в окно чата, а не в окно системных ошибок.",
			"[Прогресс] Больше не воспроизводится звук открытия панели достижений при первом просмотре.",
			"[Прогресс] Оптимизирована логика, теперь большую часть времени информация будет плавно раскрываться при первом просмотре.",
			"[Прогресс] Оптимизирован текст отображения, теперь Вы можете видеть количество сундуков в записях М+.",
			"[Трекер Событий] Переключение списка заданий теперь автоматически вызывает обновление ширины панели.",
			"[Помощник Класса] Попытка исправить проблемы с инструментами Рыцаря Смерти. Спасибо AngelosNaoumis",
		},
	},
}
