local W = unpack((select(2, ...)))

W.Changelog[378] = {
	RELEASE_DATE = "2024/09/18",
	IMPORTANT = {
		["zhCN"] = {
			"我已经观察到部分玩家使用插件时会造成帧数下降，目前推测是某些 Bug 物品和地下堡中暴雪过多的事件触发导致的，下版本会尝试用代码进行一些回避来优化。",
			"副本名缩写和 RaiderIO 插件的副本名缩写保持一致。",
		},
		["zhTW"] = {
			"我已經觀察到部分玩家使用插件時會造成幀數下降，目前推測是某些 Bug 物品和探究中暴雪過多的事件觸發導致的，下版本會嘗試用代碼進行一些回避來優化。",
			"副本名縮寫和 RaiderIO 插件的副本名縮寫保持一致。",
		},
		["enUS"] = {
			"I have observed that some players will experience a frame rate drop when using the plugin. I currently suspect that it is caused by some bug items and too many events triggered in the delves. In the next version, I will try to optimize it by avoiding some of them.",
			"Keep the instance name abbreviation consistent with the RaiderIO.",
		},
		["koKR"] = {
			"일부 플레이어가 플러그인을 사용할 때 프레임 속도가 떨어지는 현상을 관찰했습니다. 현재 일부 버그 아이템과 던전에서 너무 많은 이벤트가 발생하는 것이 원인이라고 의심하고 있습니다. 다음 버전에서는 이를 피하도록 코드를 사용하여 최적화하려고합니다.",
			"던전 이름 약어를 RaiderIO와 일치하도록 유지합니다.",
		},
		["ruRU"] = {
			"Я заметил, что некоторые игроки испытывают падение частоты кадров при использовании плагина. В настоящее время я подозреваю, что это вызвано некоторыми ошибочными предметами и слишком большим количеством событий, вызванных в подземельях. В следующей версии я попробую оптимизировать это, избегая некоторых из них.",
			"Сохраните сокращение названия подземелья в соответствии с плагином RaiderIO.",
		},
	},
	NEW = {
		["zhCN"] = {},
		["zhTW"] = {},
		["enUS"] = {},
		["koKR"] = {},
		["ruRU"] = {},
	},
	IMPROVEMENT = {
		["zhCN"] = {
			"[额外物品条] 更新默认黑名单物品。",
			"[鼠标提示] 添加了第一赛季的限时计算数据。",
			"[鼠标提示] 优化了强制物品等级的功能逻辑，现在在观察他人时会自动停止以防止暴雪的天赋缓存被替换。不过开关依旧默认关闭。",
			"[鼠标提示] 修复了在切换配置文件时可能导致的一个错误。",
			"[鼠标提示] 修复了史诗钥石信息功能可能导致的一个错误。",
			"[鼠标提示] 优化了目标进度（主要是史诗钥石的小怪进度）。现在能够更好的和其他鼠标提示插件共同运作。",
			"[鼠标提示] 默认调小了一点鼠标提示中的副本图示大小。",
		},
		["zhTW"] = {
			"[額外物品條] 更新了預設黑名單物品。",
			"[浮動提示] 添加了第一賽季的限時計算數據。",
			"[浮動提示] 優化了強制物品等級的功能邏輯，現在在觀察他人時會自動停止以防止暴雪的天賦緩存被替換。不過開關依然預設關閉。",
			"[浮動提示] 修復了在切換配置文件時可能導致的一個錯誤。",
			"[浮動提示] 修復了史詩鑰石信息功能可能導致的一個錯誤。",
			"[浮動提示] 優化了目標進度（主要是傳奇鑰石的小怪進度）。現在能夠更好的和其他浮動提示插件共同運作。",
			"[浮動提示] 默認調小了一點浮動提示中的副本圖示大小。",
		},
		["enUS"] = {
			"[Extra Item Bar] Updated the default blacklist items.",
			"[Tooltip] Add the S1 upgrades calculation data.",
			"[Tooltip] Optimize the logic of the Force Item Level. Now it will automatically stop when inspecting others to prevent Blizzard's talent cache from being replaced. However, the switch is still off by default.",
			"[Tooltip] Fix an error that may occur when switching ElvUI profiles.",
			"[Tooltip] Fix an error that may occur in the Better Mythic+ information.",
			"[Tooltip] Optimize the objective progress (mainly the progress of the M+ enemies). Now it can work better with other tooltip plugins.",
			"[Tooltip] Default scale down the size of the instance icon in the tooltip.",
		},
		["koKR"] = {
			"[추가 아이템 바] 기본 블랙리스트 아이템을 업데이트했습니다.",
			"[툴팁] S1 업그레이드 계산 데이터를 추가했습니다.",
			"[툴팁] 강제 아이템 레벨의 로직을 최적화했습니다. 이제 다른 사람을 검사할 때 자동으로 중지되어 블리자드의 재능 캐시가 교체되는 것을 방지합니다. 그러나 스위치는 여전히 기본적으로 꺼져 있습니다.",
			"[툴팁] ElvUI 프로필을 전환할 때 발생할 수 있는 오류를 수정했습니다.",
			"[툴팁] 다른 M+ 정보에서 발생할 수 있는 오류를 수정했습니다.",
			"[툴팁] 목표 진행률을 최적화했습니다(주로 M+ 적들의 진행률). 이제 다른 툴팁 플러그인과 더 잘 작동할 수 있습니다.",
		},
		["ruRU"] = {
			"[Дополнительная панель предметов] Обновлен список предметов в черном списке.",
			"[Подсказка] Добавлены данные расчета улучшений S1.",
			"[Подсказка] Оптимизирована логика принудительного уровня предмета. Теперь он автоматически останавливается при проверке других игроков, чтобы предотвратить замену кэша талантов Blizzard. Однако переключатель по-прежнему отключен по умолчанию.",
			"[Подсказка] Исправлена ошибка, которая могла возникнуть при переключении профилей ElvUI.",
			"[Подсказка] Исправлена ошибка, которая могла возникнуть в улучшенной информации M+.",
			"[Подсказка] Оптимизирован прогресс цели (в основном прогресс врагов M+). Теперь он может лучше работать с другими плагинами подсказок.",
			"[Подсказка] По умолчанию уменьшен размер значка подземелья вподсказке.",
		},
	},
}
