local W = unpack((select(2, ...))) ---@type WindTools

W.Changelog[390] = {
	RELEASE_DATE = "2025/02/28",
	IMPORTANT = {
		["zhCN"] = {
			"适配魔兽世界 11.1.0 版本.",
			"更新 OpenRaid 库。",
		},
		["zhTW"] = {
			"適配魔獸世界 11.1.0 版本.",
			"更新 OpenRaid 庫。",
		},
		["enUS"] = {
			"Support WoW 11.1.0.",
			"Update OpenRaid library.",
		},
		["koKR"] = {
			"월드 오브 워크래프트 11.1.0 지원.",
			"OpenRaid 라이브러리 업데이트.",
		},
		["ruRU"] = {
			"Поддержка WoW 11.1.0.",
			"Обновление библиотеки OpenRaid.",
		},
	},
	NEW = {
		["zhCN"] = {},
		["zhTW"] = {},
		["enUS"] = {},
		["koKR"] = {},
		["ruRU"] = {},
	},
	IMPROVEMENT = {
		["zhCN"] = {
			"[世界地图] 更新了迷雾去除数据库。",
			"[鼠标提示] 更新了 11.1 套装部位提示的数据。",
			"[鼠标提示] 更新了 S2 传奇钥石地下城的数据。",
			"[鼠标提示] 移除了 10.0 全部团队副本进度提示。",
			"[鼠标提示] 添加了 11.1 新团队副本进度提示。",
			"[预组建队伍] 更新了 S2 传奇钥石地下城的数据。",
			"[额外物品条] 更新了物品列表。感谢 mcc1",
			"[美化皮肤] 更新 Simple Addon Manager 的皮肤。",
		},
		["zhTW"] = {
			"[世界地圖] 更新了迷霧去除資料庫。",
			"[滑鼠提示] 更新了 11.1 套裝部位提示的數據。",
			"[滑鼠提示] 更新了 S2 傳奇鑰石地城的數據。",
			"[滑鼠提示] 移除了 10.0 全部團隊副本進度提示。",
			"[滑鼠提示] 添加了 11.1 新團隊副本進度提示。",
			"[預組隊伍] 更新了 S2 傳奇鑰石地城的數據。",
			"[額外物品條] 更新了物品列表。感謝 mcc1",
			"[美化皮膚] 更新 Simple Addon Manager 的皮膚。",
		},
		["enUS"] = {
			"[World Map] Update fog removal database.",
			"[Tooltips] Update 11.1 tier set tooltips.",
			"[Tooltips] Update S2 Mythic+ dungeons tooltips.",
			"[Tooltips] Remove all 10.0 raid progression tooltips.",
			"[Tooltips] Add new 11.1 raid progression tooltips.",
			"[LFG List] Update S2 Mythic+ dungeons data.",
			"[Extra Item Bar] Update item list. Thanks to mcc1",
			"[Skins] Update Simple Addon Manager skins.",
		},
		["koKR"] = {
			"[월드맵] 안개 제거 데이터베이스를 업데이트했습니다.",
			"[툴팁] 11.1 티어 세트 툴팁을 업데이트했습니다.",
			"[툴팁] S2 신화+ 던전 툴팁을 업데이트했습니다.",
			"[툴팁] 10.0 레이드 진행 툴팁을 모두 제거했습니다.",
			"[툴팁] 새로운 11.1 레이드 진행 툴팁을 추가했습니다.",
			"[파티 찾기] S2 신화+ 던전 데이터를 업데이트했습니다.",
			"[추가 아이템 바] 아이템 목록을 업데이트했습니다. mcc1에게 감사드립니다.",
			"[스킨] Simple Addon Manager 스킨을 업데이트했습니다.",
		},
		["ruRU"] = {
			"[Карта мира] Обновлена база данных по удалению тумана.",
			"[Подсказки] Обновлены подсказки для комплектов брони (11.1).",
			"[Подсказки] Обновлены подсказки для М+ 2-го сезона (11.1).",
			"[Подсказки] Удалены все подсказки для рейдов 10.0.",
			"[Подсказки] Добавлены новые подсказки для рейдов 11.1.",
			"[Поиск группы] Обновлены данные для М+ 2-го сезона (11.1).",
			"[Дополнительная панель предметов] Обновлен список предметов. Спасибо mcc1.",
			"[Скины] Обновлены скины для Simple Addon Manager.",
		},
	},
}
