local W = unpack(select(2, ...))

W.Changelog[200] = {
    RELEASE_DATE = "2020/9/24",
    IMPORTANT=  {
        "完全重写了全部模块和核心功能",
    },
    NEW = {
        "新增右键菜单功能",
        "新增进出战斗动画功能",
        "新增小地图点击者功能",
        "新增矩形小地图功能",
        "新增快速焦点功能",
        "新增任务栏快捷开关按钮",
        "新增聊天文字修改功能",
        "新增单位框体图标组切换功能",
        "新增单位框体生命条文字, 位置修改功能",
        "新增幻化套装支持神器的功能",
        "新增 Ace3-GUI 部分 Widget 组件皮肤",
        "新增 Hekili 插件皮肤",
        "新增 Immersion 插件皮肤",
        "新增 WeakAuras_Option 插件皮肤",
    },
    IMPROVEMENT = {
        "更新 9.0 地图迷雾去除",
        "更新 9.0 暗影国度的大餐和技能通报",
        "更新 9.0 暗影国度的药水, 药剂等物品的自动物品列表",
        "为团队标记条添加团队确认, 倒数, 高级战斗记录开关等功能",
        "完善暴雪, ElvUI, WindTools 窗口及模块的边缘美化",
        "修复 BigWigs 插件皮肤",
        "修复 WeakAuras 插件皮肤",
        "修复与 ElvUI_MerathilisUI 同时使用时可能发生的错误",
        "修复聊天链接图标中不显示天赋图标的问题",
        "修复移动框体可能造成的错误",
        "修复聊天条功能加入世界频道时可能造成的频道丢失问题"
    }
}