local W = unpack(select(2, ...))

W.Changelog[319] = {
    RELEASE_DATE = "TBD",
    IMPORTANT = {
        ["zhCN"] = {
            "[额外物品条] 将巨龙时代铭文制造的可用于武器的符文从 UTILITY 分类移动到 RUNE 分类."
        },
        ["zhTW"] = {},
        ["enUS"] = {},
        ["koKR"] = {}
    },
    NEW = {
        ["zhCN"] = {
            "[额外物品条] 新增 PROF (专业点道具) 分类. 感谢 Tednik"
        },
        ["zhTW"] = {},
        ["enUS"] = {},
        ["koKR"] = {}
    },
    IMPROVEMENT = {
        ["zhCN"] = {
            "[通告] 修复一个可能发生的任务通告错误.",
            "[额外物品条] 更新可开启物品列表.",
            "[额外物品条] 清理暗影国度版本中的一些实用物品.",
            "[额外物品条] 条 1 默认设置中增加了 PROF 分类.",
            "[额外物品条] 条 3 默认设置中增加了 RUNE 分类.",
            "[额外物品条] 修复了品质图标在启用滑过显示时滞留.",
            "[游戏条] 新增 1 个炉石玩具.",
            "[观察] 更新附魔 ID 数据库. 感谢 bgp314@NGA",
            "[鼠标提示] 目标进度数据更新至 10.0.2.",
            "[矩形小地图] 越界的 HandyNotes 图标现在会自动隐藏."
        },
        ["zhTW"] = {},
        ["enUS"] = {},
        ["koKR"] = {}
    }
}
