local W = unpack((select(2, ...)))

W.Changelog[359] = {
    RELEASE_DATE = "2024/07/27",
    IMPORTANT = {
        ["zhCN"] = {
            "适配魔兽世界 11.0 版本.",
            "适配 ElvUI 13.72 版本.",
            "还有部分模块不能正常工作, 请耐心等待更新."
        },
        ["zhTW"] = {
            "適配魔獸世界 11.0 版本.",
            "適配 ElvUI 13.72 版本.",
            "還有部分模組不能正常工作, 請耐心等待更新."
        },
        ["enUS"] = {
            "Support WoW 11.0.",
            "Support ElvUI 13.72.",
            "Some modules still not working properly, please wait for the update."
        },
        ["koKR"] = {
            "월드 오브 워크래프트 11.0 지원.",
            "ElvUI 13.72 지원.",
            "아직 일부 모듈이 제대로 작동하지 않습니다. 업데이트를 기다려주십시오."
        },
        ["ruRU"] = {
            "Поддержка WoW 11.0.",
            "Поддержка ElvUI 13.72.",
            "Некоторые модули все еще работают неправильно, пожалуйста, дождитесь обновления."
        }
    },
    NEW = {
        ["zhCN"] = {
            "[美化皮肤] 新增了新的玩家法术书框体的皮肤.",
            "[美化皮肤] 新增了新的专业法术书框体的皮肤.",
            "[美化皮肤] 新增了兽栏框体的皮肤.",
            "[移动框体] 新增了新的玩家法术书框体的移动.",
            "[移动框体] 新增了新的专业法术框体的移动.",
            "[移动框体] 新增了兽栏框体的移动."
        },
        ["zhTW"] = {
            "[美化皮膚] 新增了新的玩家法術書框架的皮膚.",
            "[美化皮膚] 新增了新的專業法術書框架的皮膚.",
            "[美化皮膚] 新增了獸欄框架的皮膚.",
            "[移動框架] 新增了新的玩家法術書框架的移動.",
            "[移動框架] 新增了新的專業法術框架的移動.",
            "[移動框架] 新增了獸欄框架的移動."
        },
        ["enUS"] = {
            "[Skins] Added new skin for the new player spell book frame.",
            "[Skins] Added new skin for the new professions book frame.",
            "[Skins] Added new skin for the stable frame.",
            "[Move Frames] Added new move for the new player spell book frame.",
            "[Move Frames] Added new move for the new profession spell book frame.",
            "[Move Frames] Added new move for the stable frame."
        },
        ["koKR"] = {
            "[스킨] 새로운 플레이어 주문서 프레임의 스킨이 추가되었습니다.",
            "[스킨] 새로운 전문가 주문서 프레임의 스킨이 추가되었습니다.",
            "[스킨] 새로운 안정 프레임의 스킨이 추가되었습니다.",
            "[이동 프레임] 새로운 플레이어 주문서 프레임의 이동이 추가되었습니다.",
            "[이동 프레임] 새로운 전문가 주문서 프레임의 이동이 추가되었습니다.",
            "[이동 프레임] 새로운 안정 프레임의 이동이 추가되었습니다."
        },
        ["ruRU"] = {
            "[Скины] Добавлен новый скин для нового окна книги заклинаний игрока.",
            "[Скины] Добавлен новый скин для нового окна книги профессий.",
            "[Скины] Добавлен новый скин для окна стойла.",
            "[Перемещение окон] Добавлено новое перемещение для нового окна книги заклинаний игрока.",
            "[Перемещение окон] Добавлено новое перемещение для нового окна книги профессий.",
            "[Перемещение окон] Добавлено новое перемещение для окна стойла."
        }
    },
    IMPROVEMENT = {
        ["zhCN"] = {
            "[额外物品条] 现在快捷键的缩写风格与 ElvUI 一致.",
            "[信息文字] 系统信息文字现在战斗中点击现在会提示错误, 而不是产生污染."
        },
        ["zhTW"] = {
            "[額外物品條] 現在按鍵的縮寫風格與 ElvUI 一致.",
            "[訊息文字] 系統訊息文字現在戰鬥中點擊現在會提示錯誤, 而不是產生污染."
        },
        ["enUS"] = {
            "[Extra Item Bar] Now the abbreviation style of keybinds is consistent with ElvUI.",
            "[Datatext] System information text now show an UI error when clicked in combat, rather than causing taint."
        },
        ["koKR"] = {
            "[추가 행동 단추] 이제 단축키 약어 스타일이 ElvUI와 일치합니다.",
            "[정보 텍스트] 이제 전투 중에 클릭하면 시스템 정보 텍스트가 오류를 표시하고 오염을 일으키지 않습니다."
        },
        ["ruRU"] = {
            "[Дополнительная панель предметов] Теперь стиль сокращений клавиш соответствует ElvUI.",
            "[Текст информации] Текст системной информации теперь показывает сообщение об ошибке при нажатии в бою, а не вызывает загрязнение."
        }
    }
}
