local W = unpack((select(2, ...)))

W.Changelog[362] = {
    RELEASE_DATE = "Alpha",
    IMPORTANT = {
        ["zhCN"] = {
            "更新了爱发电的捐助链接。",
            "为 11.0.2 做一些准备工作。"
        },
        ["zhTW"] = {
            "更新了愛發電的捐助連結。",
            "為 11.0.2 做一些準備工作。"
        },
        ["enUS"] = {
            "Updated the donation link of Afdian (爱发电).",
            "Prepare for 11.0.2."
        },
        ["koKR"] = {
            "Afdian (爱发电)의 기부 링크를 업데이트했습니다.",
            "11.0.2를 위한 준비를 하십시오."
        },
        ["ruRU"] = {
            "Обновлена ссылка на пожертвование Afdian (爱发电).",
            "Подготовка к 11.0.2."
        }
    },
    NEW = {
        ["zhCN"] = {},
        ["zhTW"] = {},
        ["enUS"] = {},
        ["koKR"] = {},
        ["ruRU"] = {}
    },
    IMPROVEMENT = {
        ["zhCN"] = {
            "[美化皮肤] 修复 Myslot 插件美化皮肤。",
            "[美化皮肤] 优化了商栈的美化皮肤。",
            "[美化皮肤] 进一步尝试解决任务物品按钮美化污染的问题。",
            "[事件追踪器] 现在可以设定每日完成后图标是否为黑白了。",
            "[切换按钮] 现在切换按钮会在宠物战斗中自动隐藏。",
            "[任务列表] 顶部文字现在能够正确被美化了。"
        },
        ["zhTW"] = {
            "[美化皮膚] 修復 Myslot 插件美化皮膚。",
            "[美化皮膚] 優化了貿易站的美化皮膚。",
            "[美化皮膚] 進一步嘗試解決任務物品按鈕美化污染的問題。",
            "[事件追蹤器] 現在可以設定每日完成後圖標是否為黑白了。",
            "[切換按鍵] 現在切換按鈕會在寵物戰鬥中自動隱藏。",
            "[任務列表] 頂部文字現在能夠正確被美化了。"
        },
        ["enUS"] = {
            "[Skins] Fixed Myslot skin.",
            "[Skins] Optimized the skin of the Perks Program.",
            "[Skins] Further attempts to solve the problem of taint of the quest item button skin.",
            "[Event Tracker] Now you can set the desaturate icon after daily completion.",
            "[Switch Button] The switch button will now automatically hide during pet battles.",
            "[Quest List] The header text can now be properly skinned."
        },
        ["koKR"] = {
            "[스킨] Myslot 스킨이 수정되었습니다.",
            "[스킨] 혜택 프로그램의 스킨이 최적화되었습니다.",
            "[스킨] 퀘스트 아이템 버튼 스킨 오염 문제를 해결하기 위한 추가 시도.",
            "[이벤트 추적기] 이제 일일 완료 후 아이콘을 흑백으로 설정할 수 있습니다.",
            "[전환 버튼] 전환 버튼은 이제 애왔 전투 중에 자동으로 숨겨집니다.",
            "[퀘스트 목록] 헤더 텍스트가 올바르게 스킨되었습니다."
        },
        ["ruRU"] = {
            "[Скины] Исправлен скин Myslot.",
            "[Скины] Оптимизирован скин программы привилегий.",
            "[Скины] Дополнительные попытки решить проблему загрязнения скина кнопки предмета задания.",
            "[Отслеживание событий] Теперь вы можете установить оттенок иконки после ежедневного завершения.",
            "[Кнопка переключения] Кнопка переключения теперь автоматически скрывается во время битвы питомцев.",
            "[Список заданий] Заголовок теперь можно правильно оформить."
        }
    }
}
