local W = unpack((select(2, ...))) ---@type WindTools

W.Changelog[406] = {
	RELEASE_DATE = "TBD",
	IMPORTANT = {
		["zhCN"] = {},
		["zhTW"] = {},
		["enUS"] = {},
		["koKR"] = {},
		["ruRU"] = {},
	},
	NEW = {
		["zhCN"] = {
			"[游戏条] 新增住宅按钮.",
			"[美化外观] 新增住宅系统美化.",
			"[美化外观] 新增住宅物品获得提示美化.",
			"[美化外观] 新增鼠标提示比较标题美化.",
		},
		["zhTW"] = {
			"[遊戲條] 新增住宅按鈕.",
			"[美化外觀] 新增住宅系統美化.",
			"[美化外觀] 新增住宅物品獲得提示美化.",
			"[美化外觀] 新增鼠標提示比較標題美化.",
		},
		["enUS"] = {
			"[Game Bar] Add Home button.",
			"[Skins] Add housing system skins.",
			"[Skins] Add skin for housing item earned alert.",
			"[Skins] Add skin for tooltip compare header.",
		},
		["koKR"] = {
			"[게임 바] 홈 버튼이 추가되었습니다.",
			"[스킨] 주택 시스템 스킨이 추가되었습니다.",
			"[스킨] 주택 아이템 획득 알림에 스킨이 추가되었습니다.",
			"[스킨] 툴팁 비교 헤더에 스킨이 추가되었습니다.",
		},
		["ruRU"] = {
			"[Игровая панель] Добавлена кнопка 'Домой'.",
			"[Скины] Добавлены скины системы жилья.",
			"[Скины] Добавлен скин для оповещения о получении предмета жилья.",
			"[Скины] Добавлен скин для заголовка сравнения в подсказках.",
		},
	},
	IMPROVEMENT = {
		["zhCN"] = {
			"[游戏条] 将之前的家按钮改动为炉石按钮.",
			"[额外物品条] 新增了一些 Remix 可开启物品. 感谢 Tsxy",
			"[聊天文字] 同步了 ElvUI 最新聊天模块改动.",
			"[美化外观] 优化观察框架代码逻辑.",
		},
		["zhTW"] = {
			"[遊戲條] 將之前的家按鈕改動為爐石按鈕.",
			"[額外物品條] 新增了一些 Remix 可開啟物品. 感謝 Tsxy",
			"[聊天文字] 同步了 ElvUI 最新聊天模組改動.",
			"[美化外觀] 優化觀察框架代碼邏輯.",
		},
		["enUS"] = {
			"[Game Bar] Change the previous Home button to Hearthstone button.",
			"[Extra Item Bar] Add some Remix openable items. Thanks Tsxy",
			"[Chat Text] Synchronized with ElvUI latest chat module changes.",
			"[Skins] Optimize Inspect frame code logic.",
		},
		["koKR"] = {
			"[게임 바] 이전 홈 버튼이 하스스톤 버튼으로 변경되었습니다.",
			"[추가 아이템 바] 일부 Remix 사용 가능한 아이템을 추가했습니다. Tsxy 감사합니다",
			"[채팅 텍스트] ElvUI 최신 채팅 모듈 변경사항과 동기화되었습니다.",
			"[스킨] 살펴보기 프레임 코드 로직을 최적화했습니다.",
		},
		["ruRU"] = {
			"[Игровая панель] Кнопка 'Домой' изменена на кнопку 'Камень возвращения'.",
			"[Дополнительная панель предметов] Добавлены некоторые предметы, которые можно открыть в Remix. Спасибо Tsxy",
			"[Текст чата] Синхронизировано с последними изменениями модуля чата ElvUI.",
			"[Скины] Оптимизирована логика кода окна осмотра.",
		},
	},
}
