local W = unpack((select(2, ...))) ---@type WindTools

W.Changelog[413] = {
	RELEASE_DATE = "2026/03/01",
	IMPORTANT = {
		["zhCN"] = {
			"[退出相位潜行] 作为地心之战版本功能, 默认关闭.",
			"[事件追踪器] 默认关闭地心之战版本的事件. 至暗之夜版本的事件将在我的角色满级后添加支持.",
		},
		["zhTW"] = {
			"[退出相位深潛] 作為地心之戰版本功能, 預設關閉.",
			"[事件追蹤器] 預設關閉地心之戰版本的事件. 至暗之夜版本的事件將在我的角色滿級後添加支持.",
		},
		["enUS"] = {
			"[Exit Phase Diving] As a feature for TWW, it is now disabled by default.",
			"[Event Tracker] TWW events are disabled by default. Midnight events will be added after my character reaches max level.",
		},
		["koKR"] = {
			"[상태 이상] TWW 버전의 기능으로, 기본적으로 비활성화되어 있습니다.",
			"[이벤트 추적기] TWW 버전의 이벤트는 기본적으로 비활성화되어 있습니다. 미드나이트 이벤트는 제 캐릭터가 최대 레벨에 도달한 후에 추가될 예정입니다.",
		},
		["ruRU"] = {
			"[Выход из фазы] Функция была для 'Войны Внутри', теперь она по умолчанию отключена.",
			"[Трекер событий] События 'Войны Внутри' по умолчанию отключены. События 'Полночи' будут добавлены после того, как мой персонаж достигнет максимального уровня.",
		},
	},
	NEW = {
		["zhCN"] = {
			"[美化外观] 新增了 AppearanceTooltip 皮肤.",
			"[游戏条] 支持至暗之夜版本的炉石物品.",
		},
		["zhTW"] = {
			"[美化外觀] 新增了 AppearanceTooltip 皮膚.",
			"[遊戲條] 支持至暗之夜版本的爐石物品.",
		},
		["enUS"] = {
			"[Skins] Added a skin for AppearanceTooltip.",
			"[Game Bar] Added new Midnight Hearthstone item support.",
		},
		["koKR"] = {
			"[스킨] AppearanceTooltip 스킨이 추가되었습니다.",
			"[게임 바] 미드나이트 버전의 하스스톤 아이템 지원이 추가되었습니다.",
		},
		["ruRU"] = {
			"[Скины] Добавлена поддержка скина для AppearanceTooltip.",
			"[Игровая панель] Добавлена поддержка нового предмета для 'Полночи' - Камня возвращения.",
		},
	},
	IMPROVEMENT = {
		["zhCN"] = {
			"[美化外观] UI 错误框体现在能够更加正确地彻底禁用了.",
			"[装备观察] 新增了至暗之夜的附魔数据. 感谢 Witnesscm.",
			"[装备观察] 修复了装备等级获取失败时可能导致的错误.",
			"[好友列表] 正式服好友在线图标现在变更为至暗之夜版本.",
			"[鼠标提示] - [进度] 地下城数据更新为至暗之夜第一赛季.",
			"[鼠标提示] - [套装] 套装数据更新为至暗之夜第一赛季.",
			"[鼠标提示] - [ElvUI 鼠标提示微调] 修复了血条和血量文本的垂直偏移功能.",
			"[预组建队伍] 地下城过滤器更新为至暗之夜第一赛季.",
			"[小地图按钮] 移除了默认隐藏 Plumber 的逻辑.",
		},
		["zhTW"] = {
			"[美化外觀] UI 錯誤框架現在能夠更加正確地徹底禁用了.",
			"[裝備觀察] 新增了至暗之夜的附魔數據. 感謝 Witnesscm.",
			"[裝備觀察] 修復了裝備等級獲取失敗時可能導致的錯誤.",
			"[好友列表] 正式服好友在線圖標現在變更為至暗之夜版本.",
			"[浮動提示] - [進度] 地下城數據更新為至暗之夜第一賽季.",
			"[浮動提示] - [套裝] 套裝數據更新為至暗之夜第一賽季.",
			"[浮動提示] - [ElvUI 浮動提示微調] 修復了血條和血量文本的垂直偏移功能.",
			"[預組隊伍] 地下城過濾器更新為至暗之夜第一賽季.",
			"[小地圖按鈕] 移除了默认隐藏 Plumber 的逻辑.",
		},
		["enUS"] = {
			"[Skins] The UI Errors frame can now be more properly and thoroughly disabled.",
			"[Inspect] Added enchant data for Midnight. Thanks Witnesscm.",
			"[Inspect] Fixed a possible error when item level retrieval fails.",
			"[Friends List] The online icon for retail has now been changed to the Midnight version.",
			"[Tooltip] - [Progression] Dungeon data updated for Midnight S1.",
			"[Tooltip] - [Tier Set] Tier set data updated for Midnight S1.",
			"[Tooltip] - [ElvUI Tooltip Tweaks] Fixed the vertical offset feature for the health bar and health text.",
			"[LFG List] Dungeon filters updated for Midnight S1.",
			"[Minimap Button] Removed the logic that hides Plumber by default.",
		},
		["koKR"] = {
			"[스킨] UI 오류 프레임이 이제 더 제대로 완전히 비활성화될 수 있습니다.",
			"[장비 정보] 미드나이트의 인챈트 데이터가 추가되었습니다. Witnesscm님께 감사드립니다.",
			"[장비 정보] 아이템 레벨 검색 실패 시 발생할 수 있는 오류가 수정되었습니다.",
			"[친구 목록] 공식 서버 친구 온라인 아이콘이 이제 미드나이트 버전으로 변경되었습니다.",
			"[툴팁] - [진행 상황] 던전 데이터가 미드나이트 시즌 1로 업데이트되었습니다.",
			"[툴팁] - [세트] 세트 데이터가 미드나이트 시즌 1로 업데이트되었습니다.",
			"[툴팁] - [ElvUI 툴팁 조정] 체력 바와 체력 텍스트의 수직 오프셋 기능이 수정되었습니다.",
			"[파티 찾기 목록] 던전 필터가 미드나이트 시즌 1로 업데이트되었습니다.",
			"[미니맵 버튼] Plumber를 기본적으로 숨기는 로직이 제거되었습니다.",
		},
		["ruRU"] = {
			"[Скины] Фрейм ошибок UI теперь может быть более правильно и полностью отключен.",
			"[Осмотр] Добавлены данные чар для 'Полночи'. Спасибо Witnesscm.",
			"[Осмотр] Исправлена возможная ошибка при получении уровня предмета.",
			"[Список друзей] Иконка онлайн для официального сервера теперь изменена на версию 'Полночи'.",
			"[Подсказка] - [Прогресс] Данные подземелий обновлены для 1-го сезона 'Полночи'.",
			"[Подсказка] - [Комплект] Данные комплектов обновлены для 1-го сезона 'Полночи'.",
			"[Подсказка] - [Настройки подсказки ElvUI] Исправлена функция вертикального смещения для полосы здоровья и текста здоровья.",
			"[Список ЛФГ] Фильтры подземелий обновлены для 1-го сезона 'Полночи'.",
			"[Кнопка миникарты] Удалена логика, которая по умолчанию скрывает Plumber.",
		},
	},
}
