local W, F, E, L = unpack((select(2, ...))) ---@type WindTools, Functions, ElvUI, LocaleTable
local EB = W:GetModule("ExtraItemsBar") ---@class ExtraItemsBar

local pairs = pairs
local select = select
local sort = sort
local tinsert = tinsert

local GetInstanceInfo = GetInstanceInfo

EB.STATE = {
	IN_DELVE = 1,
}

EB.StateCache = {}
EB.StateFetcher = {
	[EB.STATE.IN_DELVE] = function()
		local difficulty = select(3, GetInstanceInfo())
		if difficulty and difficulty == 208 then
			return true
		end
		return false
	end,
}

function EB:UpdateState(state)
	local fetcher = EB.StateFetcher[state]
	EB.StateCache[state] = fetcher and fetcher()
end

function EB:GetState(state)
	local result = EB.StateCache[state]
	if result == nil then
		result = true -- default to true if not cached
	end
	return result
end

EB.StateCheckList = {
	-- Items that cannot be use outside delve
	[233205] = EB.STATE.IN_DELVE, -- 迈动饮料
	[233792] = EB.STATE.IN_DELVE, -- 地下堡行者的伪装
	[248017] = EB.STATE.IN_DELVE, -- 尖啸石英
	[248755] = EB.STATE.IN_DELVE, -- 罐装星辰
	[248764] = EB.STATE.IN_DELVE, -- 精工闪现陷阱
	[248954] = EB.STATE.IN_DELVE, -- 虚空扭曲之种
}

-- If the item is lower than the threshold, it will be considered not shown
EB.CountThreshold = {
	[245653] = 100, -- 宝匣钥匙碎片
	[253224] = 10, -- 破碎时间的微粒
	[254267] = 100, -- 粉碎的纪元挑战纪念品
}

local potions = {
	general = {
		5512, -- 治疗石
		177278, -- 静谧之瓶
		224464, -- 恶魔治疗石
	},
	legacy = {
		109217, -- 德拉诺敏捷药水
		109218, -- 德拉诺智力药水
		109219, -- 德拉诺力量药水
		109220, -- 德拉诺全能药水
		109221, -- 德拉诺法力引导药水
		109222, -- 德拉诺法力药水
		109226, -- 德拉诺活力药水
		114124, -- 幽灵药水
		115531, -- 阿什兰涡流药水
		116925, -- 古方自由行动药水
		118278, -- 苍白幻象药水
		118910, -- 拳手的德拉诺敏捷药水
		118911, -- 拳手的德拉诺智慧药水
		118912, -- 拳手的德拉诺力量药水
		118913, -- 拳手的无尽德拉诺敏捷药水
		118914, -- 拳手的无尽德拉诺智慧药水
		118915, -- 拳手的无尽德拉诺力量药水
		122453, -- 指挥官的德拉诺敏捷药水
		122454, -- 指挥官的德拉诺智力药水
		122455, -- 指挥官的德拉诺力量药水
		122456, -- 指挥官的德拉诺全能药水
		127834, -- 古代治疗药水
		127835, -- 古代法力药水
		127836, -- 古代活力药水
		127843, -- 致命优雅药水
		127844, -- 上古战神药水
		127845, -- 不屈药水
		127846, -- 魔力洪流药水
		136569, -- 陈年治疗药水
		142117, -- 延时之力药水
		142325, -- 拳手的古代治疗药水
		142326, -- 拳手的延时之力药水
		144396, -- 英勇治疗药水
		144397, -- 英勇护甲药水
		144398, -- 英勇怒气药水
		152494, -- 海滨治疗药水
		152495, -- 海滨法力药水
		152497, -- 轻足药水
		152503, -- 隐蔽药水
		152550, -- 海雾药水
		152557, -- 钢肤药水
		152559, -- 死亡崛起药水
		152560, -- 鲜血喷发药水
		152561, -- 滋养药水
		152615, -- 星界治疗药水
		152619, -- 星界法力药水
		163082, -- 海滨活力药水
		163222, -- 智力战斗药水
		163223, -- 敏捷战斗药水
		163224, -- 力量战斗药水
		163225, -- 耐力战斗药水
		167917, -- 拳手的海滨治疗药水
		167918, -- 拳手的力量战斗药水
		167919, -- 拳手的敏捷战斗药水
		167920, -- 拳手的智力战斗药水
		168489, -- 超强敏捷战斗药水
		168498, -- 超强智力战斗药水
		168499, -- 超强耐力战斗药水
		168500, -- 超强力量战斗药水
		168501, -- 超强钢肤药水
		168502, -- 复原药水
		168506, -- 专注决心药水
		168529, -- 邻位强化药水
		169299, -- 无拘之怒药水
		169300, -- 狂野愈合药水
		169451, -- 深渊治疗药水
	},
	sl = {
		-- https://www.wowhead.com/items/consumables/potions/min-level:40/min-req-level:51/max-req-level:60?filter=161:166;1:9;0:0
		171263, -- 灵魂净化药水
		171264, -- 阴翳视线药水
		171266, -- 隐秘精魂药水
		171267, -- 灵魂治疗药水
		171268, -- 灵魂法力药水
		171269, -- 灵魂活力药水
		171270, -- 幽魂敏捷药水
		171271, -- 硬化暗影药水
		171272, -- 灵魂神智药水
		171273, -- 幽魂智力药水
		171274, -- 幽魂耐力药水
		171275, -- 幽魂力量药水
		171349, -- 幻影火焰药水
		171350, -- 神圣觉醒药水
		171351, -- 死亡偏执药水
		171352, -- 强化驱魔药水
		171370, -- 幽魂迅捷药水
		176811, -- 献祭心能药水
		180317, -- 销魂治疗药水
		180318, -- 销魂法力药水
		181620, -- 煮老的戈姆蛋
		182382, -- 邪恶抗性合剂
		183823, -- 无拘移动药水
		187802, -- 宇宙治疗药水
	},
	df = {
		-- https://www.wowhead.com/items/consumables/potions/min-level:40/min-req-level:61/max-req-level:70?filter=161:166;1:10;0:0
		191351, -- 冻结宿命药水 (1)
		191352, -- 冻结宿命药水 (2)
		191353, -- 冻结宿命药水 (3)
		191360, -- 瓶装溃烂 (1)
		191361, -- 瓶装溃烂 (2)
		191362, -- 瓶装溃烂 (3)
		191363, -- 冻结专注药水 (1)
		191364, -- 冻结专注药水 (2)
		191365, -- 冻结专注药水 (3)
		191366, -- 伤寒清醒药水 (1)
		191367, -- 伤寒清醒药水 (2)
		191368, -- 伤寒清醒药水 (3)
		191369, -- 枯萎活力药水 (1)
		191370, -- 枯萎活力药水 (2)
		191371, -- 枯萎活力药水 (3)
		191372, -- 神经传导残剂 (1)
		191373, -- 神经传导残剂 (2)
		191374, -- 神经传导残剂 (3)
		191375, -- 清淡孢子悬浮液 (1)
		191376, -- 清淡孢子悬浮液 (2)
		191377, -- 清淡孢子悬浮液 (3)
		191378, -- 振奋治疗药水 (1)
		191379, -- 振奋治疗药水 (2)
		191380, -- 振奋治疗药水 (3)
		191381, -- 元素究极强能药水 (1)
		191382, -- 元素究极强能药水 (2)
		191383, -- 元素究极强能药水 (3)
		191384, -- 加气法力药水 (1)
		191385, -- 加气法力药水 (2)
		191386, -- 加气法力药水 (3)
		191387, -- 元素强能药水 (1)
		191388, -- 元素强能药水 (2)
		191389, -- 元素强能药水 (3)
		191393, -- 沉静西风药水 (1)
		191394, -- 沉静西风药水 (2)
		191395, -- 沉静西风药水 (3)
		191396, -- 阵风药水 (1)
		191397, -- 阵风药水 (2)
		191398, -- 阵风药水 (3)
		191399, -- 震击揭示药水 (1)
		191400, -- 震击揭示药水 (2)
		191401, -- 震击揭示药水 (3)
		191905, -- 飞逝元素强能药水 (1)
		191906, -- 飞逝元素强能药水 (2)
		191907, -- 飞逝元素强能药水 (3)
		191912, -- 飞逝元素究极强能药水 (1)
		191913, -- 飞逝元素究极强能药水 (2)
		191914, -- 飞逝元素究极强能药水 (3)
		201427, -- 飞逝流沙
		201428, -- 水银流沙
		201436, -- 时锁流沙
		201438, -- 疲惫流沙
		207021, -- 梦行者治疗药水 (1)
		207022, -- 梦行者治疗药水 (2)
		207023, -- 梦行者治疗药水 (3)
		207039, -- 凋零梦境药水 (1)
		207040, -- 凋零梦境药水 (2)
		207041, -- 凋零梦境药水 (3)
	},
	tww = {
		-- https://www.wowhead.com/items/consumables/potions/min-level:40/min-req-level:71?filter=161:166;1:11;0:0
		211878, -- 阿加治疗药水 (1)
		211879, -- 阿加治疗药水 (2)
		211880, -- 阿加治疗药水 (3)
		212239, -- 阿加法力药水 (1)
		212240, -- 阿加法力药水 (2)
		212241, -- 阿加法力药水 (3)
		212242, -- 洞穴住民的挚爱 (1)
		212243, -- 洞穴住民的挚爱 (2)
		212244, -- 洞穴住民的挚爱 (3)
		212245, -- 沉眠魂魄血清 (1)
		212246, -- 沉眠魂魄血清 (2)
		212247, -- 沉眠魂魄血清 (3)
		212248, -- 踏雪无痕饮剂 (1)
		212249, -- 踏雪无痕饮剂 (2)
		212250, -- 踏雪无痕饮剂 (3)
		212251, -- 震慑曝光饮剂 (1)
		212252, -- 震慑曝光饮剂 (2)
		212253, -- 震慑曝光饮剂 (3)
		212254, -- 怪诞之瓶 (1)
		212255, -- 怪诞之瓶 (2)
		212256, -- 怪诞之瓶 (3)
		212257, -- 专心致志药水 (1)
		212258, -- 专心致志药水 (2)
		212259, -- 专心致志药水 (3)
		212260, -- 前线药水 (1)
		212261, -- 前线药水 (2)
		212262, -- 前线药水 (3)
		212263, -- 淬火药水 (1)
		212264, -- 淬火药水 (2)
		212265, -- 淬火药水 (3)
		212266, -- 重生猎豹药水 (1)
		212267, -- 重生猎豹药水 (2)
		212268, -- 重生猎豹药水 (3)
		212318, -- QA阿加治疗药水 (3)
		212319, -- QA阿加法力药水 (3)
		212320, -- QA洞穴住民的挚爱 (3)
		212321, -- QA沉眠魂魄血清 (3)
		212322, -- QA踏雪无痕饮剂 (3)
		212323, -- QA震慑曝光饮剂 (3)
		212324, -- QA怪诞之瓶 (3)
		212325, -- QA专心致志药水 (3)
		212326, -- QA前线药水 (3)
		212327, -- QA淬火药水 (3)
		212328, -- QA重生猎豹药水 (3)
		212942, -- 飞逝阿加治疗药水 (1)
		212943, -- 飞逝阿加治疗药水 (2)
		212944, -- 飞逝阿加治疗药水 (3)
		212945, -- 飞逝阿加法力药水 (1)
		212946, -- 飞逝阿加法力药水 (2)
		212947, -- 飞逝阿加法力药水 (3)
		212948, -- 飞逝洞穴住民的挚爱 (1)
		212949, -- 飞逝洞穴住民的挚爱 (2)
		212950, -- 飞逝洞穴住民的挚爱 (3)
		212951, -- 飞逝沉眠魂魄血清 (1)
		212952, -- 飞逝沉眠魂魄血清 (2)
		212953, -- 飞逝沉眠魂魄血清 (3)
		212954, -- 飞逝踏雪无痕饮剂 (1)
		212955, -- 飞逝踏雪无痕饮剂 (2)
		212956, -- 飞逝踏雪无痕饮剂 (3)
		212957, -- 飞逝震慑曝光饮剂 (1)
		212958, -- 飞逝震慑曝光饮剂 (2)
		212959, -- 飞逝震慑曝光饮剂 (3)
		212960, -- 飞逝毒性怪诞之瓶 (1)
		212961, -- 飞逝毒性怪诞之瓶 (2)
		212962, -- 飞逝毒性怪诞之瓶 (3)
		212963, -- 飞逝专心致志药水 (1)
		212964, -- 飞逝专心致志药水 (2)
		212965, -- 飞逝专心致志药水 (3)
		212966, -- 飞逝前线药水 (1)
		212967, -- 飞逝前线药水 (2)
		212968, -- 飞逝前线药水 (3)
		212969, -- 飞逝淬火药水 (1)
		212970, -- 飞逝淬火药水 (2)
		212971, -- 飞逝淬火药水 (3)
		212972, -- 飞逝重生猎豹药水 (1)
		212973, -- 飞逝重生猎豹药水 (2)
		212974, -- 飞逝重生猎豹药水 (3)
		244835, -- 焕生治疗药水 (1)
		244838, -- 焕生治疗药水 (2)
		244839, -- 焕生治疗药水 (3)
		244849, -- 飞逝焕生治疗药水 (3)
		248331, -- 晦幽精粹 (1)
		248585, -- 晦幽精粹 (2)
		248586, -- 晦幽精粹 (3)
	},
}

local flasks = {
	legacy = {
		127847, -- 耳语契约合剂
		127848, -- 第七恶魔合剂
		127849, -- 无尽大军合剂
		127850, -- 千万战痕合剂
		127858, -- 灵魂合剂
		152638, -- 湍流合剂
		152639, -- 无尽深邃合剂
		152640, -- 广阔天涯合剂
		152641, -- 暗潮合剂
		162518, -- 秘法合剂
		168651, -- 强效湍流合剂
		168652, -- 强效无尽深邃合剂
		168653, -- 强效广阔天涯合剂
		168654, -- 强效暗潮合剂
		168655, -- 强效秘法合剂
	},
	sl = {
		-- https://www.wowhead.com/items/consumables/flasks/min-level:40/min-req-level:51/max-req-level:60?filter=161:166;1:9;0:0
		171276, -- 幽魂强能合剂
		171278, -- 幽魂耐力合剂
		171280, -- 永恒合剂
	},
	df = {
		-- https://www.wowhead.com/items/consumables/flasks/min-level:40/min-req-level:51/max-req-level:60?filter=161:166;1:10;0:0

		191318, -- 风暴之眼瓶剂 (1)
		191319, -- 风暴之眼瓶剂 (2)
		191320, -- 风暴之眼瓶剂 (3)
		191321, -- 止风瓶剂 (1)
		191322, -- 止风瓶剂 (2)
		191323, -- 止风瓶剂 (3)
		191324, -- 冰寒庇护瓶剂 (1)
		191325, -- 冰寒庇护瓶剂 (2)
		191326, -- 冰寒庇护瓶剂 (3)
		191327, -- 腐化之怒冰冻瓶剂 (1)
		191328, -- 腐化之怒冰冻瓶剂 (2)
		191329, -- 腐化之怒冰冻瓶剂 (3)
		191330, -- 疏离注能瓶剂 (1)
		191331, -- 疏离注能瓶剂 (2)
		191332, -- 疏离注能瓶剂 (3)
		191333, -- 冰川之怒瓶剂 (1)
		191334, -- 冰川之怒瓶剂 (2)
		191335, -- 冰川之怒瓶剂 (3)
		191336, -- 静电赋能瓶剂 (1)
		191337, -- 静电赋能瓶剂 (2)
		191338, -- 静电赋能瓶剂 (3)
		191339, -- 温存全能瓶剂 (1)
		191340, -- 温存全能瓶剂 (2)
		191341, -- 温存全能瓶剂 (3)
		191342, -- 加气熟练瓶剂 (1)
		191343, -- 加气熟练瓶剂 (2)
		191344, -- 加气熟练瓶剂 (3)
		191345, -- 精细蒸腾瓶剂 (1)
		191346, -- 精细蒸腾瓶剂 (2)
		191347, -- 精细蒸腾瓶剂 (3)
		191348, -- 电荷灵敏瓶剂 (1)
		191349, -- 电荷灵敏瓶剂 (2)
		191350, -- 电荷灵敏瓶剂 (3)
		191354, -- 晶化感知瓶剂 (1)
		191355, -- 晶化感知瓶剂 (2)
		191356, -- 晶化感知瓶剂 (3)
		191357, -- 元素混沌瓶剂 (1)
		191358, -- 元素混沌瓶剂 (2)
		191359, -- 元素混沌瓶剂 (3)
		197720, -- 加气快手瓶剂 (1)
		197721, -- 加气快手瓶剂 (2)
		197722, -- 加气快手瓶剂 (3)
		204643, -- 飞逝风暴之眼瓶剂 (1)
		204644, -- 飞逝风暴之眼瓶剂 (2)
		204645, -- 飞逝风暴之眼瓶剂 (3)
		204646, -- 飞逝止风瓶剂 (1)
		204647, -- 飞逝止风瓶剂 (2)
		204648, -- 飞逝止风瓶剂 (3)
		204649, -- 飞逝冰寒庇护瓶剂 (1)
		204650, -- 飞逝冰寒庇护瓶剂 (2)
		204651, -- 飞逝冰寒庇护瓶剂 (3)
		204652, -- 飞逝腐化之怒冰冻瓶剂 (1)
		204653, -- 飞逝腐化之怒冰冻瓶剂 (2)
		204654, -- 飞逝腐化之怒冰冻瓶剂 (3)
		204655, -- 飞逝疏离注能瓶剂 (1)
		204656, -- 飞逝疏离注能瓶剂 (2)
		204657, -- 飞逝疏离注能瓶剂 (3)
		204658, -- 飞逝冰川之怒瓶剂 (1)
		204659, -- 飞逝冰川之怒瓶剂 (2)
		204660, -- 飞逝冰川之怒瓶剂 (3)
		204661, -- 飞逝静电赋能瓶剂 (1)
		204662, -- 飞逝静电赋能瓶剂 (2)
		204663, -- 飞逝静电赋能瓶剂 (3)
		204664, -- 飞逝温存全能瓶剂 (1)
		204665, -- 飞逝温存全能瓶剂 (2)
		204666, -- 飞逝温存全能瓶剂 (3)
		204667, -- 飞逝电荷灵敏瓶剂 (1)
		204668, -- 飞逝电荷灵敏瓶剂 (2)
		204669, -- 飞逝电荷灵敏瓶剂 (3)
		204670, -- 飞逝元素混沌瓶剂 (1)
		204671, -- 飞逝元素混沌瓶剂 (2)
		204672, -- 飞逝元素混沌瓶剂 (3)
	},
	tww = {
		-- https://www.wowhead.com/items/consumables/flasks/min-level:40/min-req-level:71?filter=161:166;1:11;0:0
		212269, -- 淬火侵攻合剂 (1)
		212270, -- 淬火侵攻合剂 (2)
		212271, -- 淬火侵攻合剂 (3)
		212272, -- 淬火矫健合剂 (1)
		212273, -- 淬火矫健合剂 (2)
		212274, -- 淬火矫健合剂 (3)
		212275, -- 淬火全能合剂 (1)
		212276, -- 淬火全能合剂 (2)
		212277, -- 淬火全能合剂 (3)
		212278, -- 淬火精通合剂 (1)
		212279, -- 淬火精通合剂 (2)
		212280, -- 淬火精通合剂 (3)
		212281, -- 炼金混沌合剂 (1)
		212282, -- 炼金混沌合剂 (2)
		212283, -- 炼金混沌合剂 (3)
		212289, -- 古典精神勇猛合剂
		212292, -- 荣誉勇猛合剂
		212295, -- 狂怒具象勇猛合剂
		212298, -- 摧枯拉朽勇猛合剂
		212299, -- 救赎恩典合剂 (1)
		212300, -- 救赎恩典合剂 (2)
		212301, -- 救赎恩典合剂 (3)
		212305, -- 专注奇思瓶剂 (1)
		212306, -- 专注奇思瓶剂 (2)
		212307, -- 专注奇思瓶剂 (3)
		212308, -- 洞察真视瓶剂 (1)
		212309, -- 洞察真视瓶剂 (2)
		212310, -- 洞察真视瓶剂 (3)
		212311, -- 强化灵巧瓶剂 (1)
		212312, -- 强化灵巧瓶剂 (2)
		212313, -- 强化灵巧瓶剂 (3)
		212314, -- 丰收时节瓶剂 (1)
		212315, -- 丰收时节瓶剂 (2)
		212316, -- 丰收时节瓶剂 (3)
		212725, -- 飞逝淬火侵攻合剂 (1)
		212727, -- 飞逝淬火侵攻合剂 (2)
		212728, -- 飞逝淬火侵攻合剂 (3)
		212729, -- 飞逝淬火矫健合剂 (1)
		212730, -- 飞逝淬火矫健合剂 (2)
		212731, -- 飞逝淬火矫健合剂 (3)
		212732, -- 飞逝淬火全能合剂 (1)
		212733, -- 飞逝淬火全能合剂 (2)
		212734, -- 飞逝淬火全能合剂 (3)
		212735, -- 飞逝淬火精通合剂 (1)
		212736, -- 飞逝淬火精通合剂 (2)
		212738, -- 飞逝淬火精通合剂 (3)
		212739, -- 飞逝炼金混沌合剂 (1)
		212740, -- 飞逝炼金混沌合剂 (2)
		212741, -- 飞逝炼金混沌合剂 (3)
		212745, -- 飞逝救赎恩典合剂 (1)
		212746, -- 飞逝救赎恩典合剂 (2)
		212747, -- 飞逝救赎恩典合剂 (3)
	},
}

local runes = {
	df = {
		-- https://www.wowhead.com/items/consumables/item-enhancements-temporary/min-level:50?filter=161:166;1:10;0:0
		191933, -- 原始磨刀石 (1)
		191939, -- 原始磨刀石 (2)
		191940, -- 原始磨刀石 (3)
		191943, -- 原始平衡石 (1)
		191944, -- 原始平衡石 (2)
		191945, -- 原始平衡石 (3)
		191948, -- 原始剃刀石 (1)
		191949, -- 原始剃刀石 (2)
		191950, -- 原始剃刀石 (3)
		194817, -- 尖嚎符文 (1)
		194819, -- 尖嚎符文 (2)
		194820, -- 尖嚎符文 (3)
		194821, -- 嗡鸣符文 (1)
		194822, -- 嗡鸣符文 (2)
		194823, -- 嗡鸣符文 (3)
		194824, -- 啁啾符文 (1)
		194825, -- 啁啾符文 (2)
		194826, -- 啁啾符文 (3)
		198160, -- 绝对安全的火箭 (1)
		198161, -- 绝对安全的火箭 (2)
		198162, -- 绝对安全的火箭 (3)
		198163, -- 无穷尖针堆 (1)
		198164, -- 无穷尖针堆 (2)
		198165, -- 无穷尖针堆 (3)
		204971, -- 嘶鸣符文 (1)
		204972, -- 嘶鸣符文 (2)
		204973, -- 嘶鸣符文 (3)
	},
	tww = {
		-- https://www.wowhead.com/items/consumables/item-enhancements-temporary/min-level:50?filter=161:166;1:11;0:0
		220156, -- 冒泡的蜡油
		222502, -- 镔爪磨刀石 (1)
		222503, -- 镔爪磨刀石 (2)
		222504, -- 镔爪磨刀石 (3)
		222505, -- 镔爪剃刀石 (1)
		222506, -- 镔爪剃刀石 (2)
		222507, -- 镔爪剃刀石 (3)
		222508, -- 镔爪平衡石 (1)
		222509, -- 镔爪平衡石 (2)
		222510, -- 镔爪平衡石 (3)
		223979, -- 低语蠕蚓
		224105, -- 阿加法力之油 (1)
		224106, -- 阿加法力之油 (2)
		224107, -- 阿加法力之油 (3)
		224108, -- 贝雷达尔圣恩之油 (1)
		224109, -- 贝雷达尔圣恩之油 (2)
		224110, -- 贝雷达尔圣恩之油 (3)
		224111, -- 渊毒之油 (1)
		224112, -- 渊毒之油 (2)
		224113, -- 渊毒之油 (3)
		224572, -- 晶化强化符文
		243191, -- 虚灵强化符文
	},
}

local vantus = {
	df = {
		-- https://www.wowhead.com/items/consumables/name:Vantus+Rune/min-level:50?filter=161:166;1:10;0:0
		198491, -- 凡图斯符文：化身巨龙牢窟 (1)
		198492, -- 凡图斯符文：化身巨龙牢窟 (2)
		198493, -- 凡图斯符文：化身巨龙牢窟 (3)
		204858, -- 凡图斯符文：亚贝鲁斯，焰影熔炉 (1)
		204859, -- 凡图斯符文：亚贝鲁斯，焰影熔炉 (2)
		204860, -- 凡图斯符文：亚贝鲁斯，焰影熔炉 (3)
		210247, -- 凡图斯符文：阿梅达希尔，梦境之愿 (1)
		210248, -- 凡图斯符文：阿梅达希尔，梦境之愿 (2)
		210249, -- 凡图斯符文：阿梅达希尔，梦境之愿 (3)
	},
	tww = {
		-- https://www.wowhead.com/items/consumables/name:Vantus+Rune/min-level:50?filter=161:166;1:11;0:0
		226034, -- 凡图斯符文：尼鲁巴尔王宫 (1)
		226035, -- 凡图斯符文：尼鲁巴尔王宫 (2)
		226036, -- 凡图斯符文：尼鲁巴尔王宫 (3)
		232935, -- 凡图斯符文：解放安德麦 (2)
		232936, -- 凡图斯符文：解放安德麦 (1)
		232937, -- 凡图斯符文：解放安德麦 (3)
		244147, -- 凡图斯符文：法力熔炉：欧米伽 (1)
		244148, -- 凡图斯符文：法力熔炉：欧米伽 (2)
		244149, -- 凡图斯符文：法力熔炉：欧米伽 (3)
	},
}

local foods = {
	crafted_sl = {
		-- https://www.wowhead.com/items/consumables/food-and-drinks/min-req-level:40?filter=86:166;11:9;0:0
		172040, -- 奶油糖果腌肋排
		172041, -- 刺脊鱼舒芙蕾薯条套餐
		172042, -- 惊异怡人大餐
		172043, -- 纵情饕餮盛宴
		172044, -- 肉桂骨鱼炖煮
		172045, -- 暗冠烧烤肉冻
		172046, -- 鱼子酱饼干
		172047, -- 蜜饯琥珀鱼蛋糕
		172048, -- 多肉苹果布丁
		172049, -- 苹果酱虹色煎饺
		172050, -- 香甜银鳍鱼肉肠
		172051, -- 冰淇淋肉排
		172061, -- 炽天使鸡柳
		172062, -- 油焖火腿
		172063, -- 香炸骨鱼
		172068, -- 腌肉奶昔
		172069, -- 香蕉牛肉布丁
		184682, -- 高级柠檬草配鱼排
		186704, -- 暮光茶
		186725, -- 骨餐面包
		186726, -- 多孔冰糖
		187648, -- 石头汤空锅
	},
	crafted_df = {
		-- https://www.wowhead.com/items/consumables/food-and-drinks/min-req-level:40?filter=86:166;11:10;0:0
		197758, -- 烘焙两次的土豆
		197759, -- 奶酪配小鸭饼干
		197760, -- 鲭鱼小食
		197761, -- 如若朊质
		197762, -- 甜酸蛤蜊浓汤
		197763, -- 飞龙勇士的早餐
		197770, -- 辛辣水
		197771, -- 美味龙涎
		197772, -- 搅腹茶
		197774, -- 焦烤龙蛙肉排
		197775, -- 炒蜥蜴蛋
		197776, -- 三重加料的猛犸烤肉
		197777, -- 但愿能吃
		197778, -- 适时西去
		197779, -- 獠牙鱼片
		197780, -- 海蛾鱼全餐
		197781, -- 盐焗鱼饼
		197782, -- 勇猛鱼柳
		197783, -- 芬芳海鲜盘
		197784, -- 铁板海鲜汇
		197785, -- 冰冷的复仇
		197786, -- 千骨切舌鱼
		197787, -- 蓝天碧海
		197788, -- 炖煮驼牛腩
		197789, -- 河畔野餐
		197790, -- 美味烤鸭
		197791, -- 腌肉糊
		197792, -- 既定宿命饼干
		197793, -- 育莎的丰盛炖煮
		197794, -- 卡鲁亚克盛宴
		197795, -- 飞龙美味珍肴
		202290, -- 火酒冰糕
		204072, -- 欺诈魔鬼蛋
		207054, -- 酣眠宁神花茶
	},
	crafted_tww = {
		-- https://www.wowhead.com/items/consumables/food-and-drinks/min-level:80?filter=166:86;11:11;0:0
		-- https://www.wowhead.com/items/consumables/food-and-drinks/name:Hearty?filter=166;11;0#50
		222702, -- 串烧鱼片
		222703, -- 朴素炖煮
		222704, -- 未风干的野地肉排
		222705, -- 炙烤菌丝花
		222706, -- 锅煎菌丝花
		222707, -- 陨圣峪辣椒酱
		222708, -- 心核隧途肉串
		222709, -- 跃火鱼片
		222710, -- 土豆烧肉
		222711, -- 胀肚肉排
		222712, -- 酸甜肉丸
		222713, -- 暮光嫩肉干
		222714, -- 风味肉丁
		222715, -- 焰鱼柳
		222716, -- 姜滑鱼片
		222717, -- 咸狗
		222718, -- 深鳍鱼肉饼
		222719, -- 甜辣汤
		222720, -- 特色寿司
		222721, -- 鱼肉薯条
		222722, -- 盐烤海鲜
		222723, -- 卤汁里脊
		222724, -- 炽热蜂蜜烤肉
		222725, -- 菌丝花烩饭
		222726, -- 馅料洞穴胡椒
		222727, -- 钓手挚爱
		222728, -- 贝雷达尔之慷
		222729, -- 女皇的饯别
		222730, -- 小丑的伙食
		222731, -- 外来者的补给品
		222732, -- 降圣白昼盛宴
		222733, -- 午夜舞会盛宴
		222735, -- 全味炖煮
		222736, -- 鱼薯快餐
		222740, -- 美味大餐
		222744, -- 燧烬蜜露
		222745, -- 元气饱满
		222747, -- 崩岩奶昔
		222748, -- 甜黏点心
		222749, -- 熔化的蜡条
		222750, -- 丰盛的串烧鱼片
		222751, -- 丰盛的朴素炖煮
		222752, -- 丰盛的未风干的野地肉排
		222753, -- 丰盛的炙烤菌丝花
		222754, -- 丰盛的锅煎菌丝花
		222755, -- 丰盛的陨圣峪辣椒酱
		222756, -- 丰盛的心核隧途肉串
		222757, -- 丰盛的跃火鱼片
		222758, -- 丰盛的土豆烧肉
		222759, -- 丰盛的胀肚肉排
		222760, -- 丰盛的酸甜肉丸
		222761, -- 丰盛的暮光嫩肉干
		222762, -- 丰盛的风味肉丁
		222763, -- 丰盛的焰鱼柳
		222764, -- 丰盛的姜滑鱼片
		222765, -- 丰盛的咸狗
		222766, -- 丰盛的深鳍鱼肉饼
		222767, -- 丰盛的甜辣汤
		222768, -- 丰盛的特色寿司
		222769, -- 丰盛的鱼肉薯条
		222770, -- 丰盛的盐烤海鲜
		222771, -- 丰盛的卤汁里脊
		222772, -- 丰盛的炽热蜂蜜烤肉
		222773, -- 丰盛的菌丝花烩饭
		222774, -- 丰盛的馅料洞穴胡椒
		222775, -- 丰盛的钓手挚爱
		222776, -- 丰盛的贝雷达尔之慷
		222777, -- 丰盛的女皇的饯别
		222778, -- 丰盛的小丑的伙食
		222779, -- 丰盛的外来者的补给品
		222780, -- 丰盛的降圣白昼盛宴
		222781, -- 丰盛的午夜舞会盛宴
		222783, -- 丰盛的全味炖煮
		222784, -- 丰盛的鱼薯快餐
		223968, -- 海绵炸蛋
		225592, -- 仔细剔除了内脏的肉块
		225855, -- 美味食尸鱼
		233062, -- 袋装披萨
		233118, -- 洋际外卖
		235805, -- 安德麦地道蚌肉杂烩
		235853, -- 丰盛安德麦地道蚌肉杂烩
	},
	vendor = {
		-- https://www.wowhead.com/items/consumables/food-and-drinks/min-level:80/min-req-level:75?filter=92:166;1:11;0:0
		224762, -- 地下堡行者的水囊
		226811, -- 卤汁蛆虫
		227301, -- 水晶饼块
		227302, -- 花岗岩沙拉
		227303, -- 蜡酪点心
		227304, -- 蘑菇蛋糕
		227305, -- 飞艇热狗
		227306, -- 鲭鱼圣者
		227307, -- 昆虫拌拌碗
		227308, -- 深步者香肉片
		227317, -- 熔岩可乐
		227318, -- 水银鸡尾酒
		227319, -- 狗头契诺
		227320, -- 柳魔磷火
		227321, -- 祝圣佳酿
		227322, -- 圣化沙士
		227323, -- 蘑菇茶
		227324, -- 尼鲁巴尔蜜露
		227325, -- 石头汤
		227326, -- 辉铜矿熔岩蛋糕
		227327, -- 崎岖之路
		227328, -- 蜡酪火锅
		227329, -- 久颤浓汤
		227330, -- 洞块炖肉
		227331, -- 圣人之欢
		227332, -- 啜吸以太
		227333, -- 闪光美味
		227334, -- 鼹鼠辣酱
		227335, -- 钻孔虫血布丁
		227336, -- 糖粉浆
		236633, -- 贫穷泡沫饮料
		236646, -- 加乐宫特选
		236647, -- 硬币配卡亚
		236648, -- 液氮
		236649, -- 几个松动的螺栓
		236650, -- 镇痛水
		236680, -- 蟹肉棒
		236681, -- 液态黄金
		238896, -- 马乔的超绝“鱼肉”卷饼
		247692, -- 卡雷什谷物软块
		247693, -- 发酵的迁跃兽肉粒
		247694, -- 吸入式虚空精华
		247695, -- 闪光法力滋补品
		247696, -- 浓郁气息精盐
		247698, -- 油炸吞噬者腿肉
		247699, -- 凝结“乳”蛋白
		247700, -- 正宗卡雷什蜂蜜
	},
	mage = {
		-- https://www.wowhead.com/beta/items/consumables/food-and-drinks/name:Conjured+Mana
		34062, -- 魔法点心
		43518, -- 魔法馅饼
		43523, -- 魔法酪饼
		65499, -- 魔法蛋糕
		65500, -- 魔法饼干
		65515, -- 魔法布朗尼蛋糕
		65516, -- 魔法奶油小蛋糕
		65517, -- 魔法多彩棒棒糖
		80610, -- 魔法布丁
		80618, -- 魔法煎饼
		113509, -- 魔法汉堡
	},
}

local fishings = {
	general = {
		6529, -- 闪光的小珠
		6530, -- 夜色虫
		6532, -- 明亮的小珠
		6533, -- 水下诱鱼器
		136377, -- 巨型鱼漂
		202207, -- 可重复使用的巨型鱼漂
	},
	tww = {
		-- fish lure https://www.wowhead.com/cn/items/consumables/other/name:%E9%B1%BC%E9%A5%B5?filter=166;11;0
		219002, -- 高光虹鱼鱼饵
		219003, -- 静谧河鲈鱼饵
		219004, -- 多恩梭鱼鱼饵
		219005, -- 阿拉索锤头鲨鱼饵
		219006, -- 咆哮的渔夫寻猎者鱼饵
		-- fish that can be used to get buff https://www.wowhead.com/items/trade-goods/meat?filter=166:69;11:1;0:0
		220134, -- 拖沓鲦
		220135, -- 血红鲈
		220136, -- 晶脉鲟
		220137, -- 铋鳑鲏
		220138, -- 轻吻鲦鱼
		220139, -- 低语观星鲑
		220146, -- 皇家拟雀鲷
		220152, -- 受诅食尸鱼
	},
}

local banners = {
	18606, -- 联盟军旗
	18607, -- 部落军旗
	63359, -- 协作战旗
	64398, -- 协和战旗
	64399, -- 协同战旗
	64400, -- 协作战旗
	64401, -- 协和战旗
	64402, -- 协同战旗
}

local utilities = {
	49040, -- 基维斯
	109076, -- 地精滑翔器工具包
	132514, -- 自动铁锤
	132516, -- 火枪鞋
	193470, -- 野性皮革战鼓
	221945, -- 不可抗拒的红色按钮
	221949, -- 暂停晶塔
	221953, -- 足以乱真的救急电缆 (1)
	221954, -- 足以乱真的救急电缆 (2)
	221955, -- 足以乱真的救急电缆 (3)
}

local openableItems = {
	92794, -- 飞驰联票
	139786, -- 远古魔力水晶
	139890, -- 远古魔力宝石
	140236, -- 鱼人的小玩意儿
	140245, -- 潮汐主母的魔法珍珠
	141655, -- 发光的远古魔力晶簇
	152102, -- 法罗迪斯宝箱
	152103, -- 织梦者宝箱
	152104, -- 至高岭补给品
	152105, -- 堕夜宝箱
	152106, -- 瓦拉加尔保险箱
	152107, -- 守望者补给包
	171209, -- 血痕之袋
	171210, -- 自然赐福之袋
	171211, -- 温西尔的金币包
	174652, -- 一袋遗忘的传家宝
	178040, -- 浓缩冥殇
	178078, -- 重生精魂宝箱
	178128, -- 一袋亮闪闪
	178513, -- 周年礼物
	178965, -- 园丁的小袋子
	178966, -- 园丁的袋子
	178967, -- 园丁的大袋子
	178968, -- 园丁的每周袋子
	180085, -- 格里恩纪念品
	180355, -- 华丽的圣餐盒
	180378, -- 掌炉者之箱
	180379, -- 精美编织地毯
	180380, -- 蕾丝帏帐
	180386, -- 草药师的口袋
	180442, -- 一袋罪碑
	180646, -- 不朽军团补给品
	180647, -- 晋升者补给品
	180648, -- 收割者之庭补给品
	180649, -- 荒猎团补给品
	180875, -- 马车货物
	180974, -- 新手之袋
	180975, -- 学徒之袋
	180976, -- 工匠之袋
	180977, -- 灵魂看护者之袋
	180979, -- 大型工匠之袋
	180980, -- 大型学徒之袋
	180981, -- 大型新手之袋
	180983, -- 鼓胀的工匠之袋
	180984, -- 鼓胀的学徒之袋
	180985, -- 鼓胀的新手之袋
	180988, -- 满溢的学徒之袋
	180989, -- 满溢的新手之袋
	181372, -- 晋升者的礼物
	181475, -- 林地守卫者的奖赏
	181476, -- 荒猎团的礼物
	181556, -- 王庭的礼物
	181557, -- 王庭的青睐
	181732, -- 野心礼物
	181733, -- 义缚礼物
	181741, -- 圣杰的礼物
	181767, -- 小金币包
	182590, -- 蠕蔓金币袋
	182591, -- 覆蔓注能红宝石
	183699, -- 精致的材料
	183701, -- 净化仪式材料
	183702, -- 自然的壮美
	183703, -- 骨匠的袋子
	184045, -- 收割者之庭的军火奉纳
	184046, -- 不朽军团武器箱
	184047, -- 晋升者武器箱
	184048, -- 荒猎团武器袋
	184158, -- 渗出粘液的通灵鳐之卵
	184395, -- 陨落冒险者的宝箱
	184444, -- 晋升之路的补给
	184522, -- 帷幕的协作包裹
	184589, -- 一袋药水
	184630, -- 冒险者的裁缝箱
	184631, -- 冒险者的附魔箱
	184632, -- 勇士的鱼箱
	184633, -- 勇士的肉箱
	184634, -- 冒险者的草药箱
	184635, -- 冒险者的采矿箱
	184636, -- 冒险者的剥皮箱
	184637, -- 英雄的肉箱
	184638, -- 英雄的鱼箱
	184639, -- 勇士的裁缝箱
	184640, -- 勇士的剥皮箱
	184641, -- 勇士的采矿箱
	184642, -- 勇士的草药箱
	184643, -- 勇士的附魔箱
	184644, -- 英雄的裁缝箱
	184645, -- 英雄的剥皮箱
	184646, -- 英雄的采矿箱
	184647, -- 英雄的草药箱
	184648, -- 英雄的附魔箱
	184810, -- 抢来的补给
	184811, -- 阿耳忒弥德的奖励
	184812, -- 阿波罗恩的奖励
	184843, -- 回收的补给品
	184868, -- 纳斯利亚宝物箱
	184869, -- 纳斯利亚宝物箱
	185765, -- 厚茧皮货箱
	185832, -- 阴铁矿石货箱
	185833, -- 黯光丝绸货箱
	185972, -- 折磨者宝箱
	185990, -- 收割者的战争宝箱
	185991, -- 荒猎团的战争宝箱
	185992, -- 不朽军团的战争宝箱
	185993, -- 晋升者的战争宝箱
	186196, -- 死亡先锋军战争宝箱
	186533, -- 圣所宝箱
	186650, -- 死亡先锋军补给品
	186680, -- 装满了金币的靴子
	186691, -- 装满了金币的袋子
	186694, -- 阴影矿石包
	186705, -- 装满了金币的杯子
	186706, -- 装满了金币的帽子
	186707, -- 装满了金币的板条箱
	186708, -- 装满了金币的画笔筒
	187028, -- 档案员卷宗补给品
	187029, -- 威·娜莉的神秘礼物
	187221, -- 灵魂灰烬宝箱
	187222, -- 冥殇奇点
	187254, -- 整装心能
	187278, -- 被利爪刺穿的渊誓保险箱
	187351, -- 冥殁晶簇
	187354, -- 被遗弃的掮灵背包
	187440, -- 装满羽毛的头盔
	187503, -- 成捆的存档研究
	187543, -- 死亡先锋军战争宝箱
	187551, -- 小型刻希亚补给箱
	187569, -- 掮灵的裁缝促进微粒
	187570, -- 掮灵的剥皮促进微粒
	187571, -- 掮灵的采矿促进微粒
	187572, -- 掮灵的草药促进微粒
	187573, -- 掮灵的附魔促进微粒
	187574, -- 掮灵的满溢之桶
	187575, -- 刻希亚钓鱼箱
	187576, -- 刻希亚剥皮箱
	187577, -- 刻希亚肉箱
	187780, -- 掮灵开悟者补给品
	187781, -- 奥利家族宝箱
	187817, -- 刻钍晶簇
	189765, -- 马鲁克半人马补给袋
	190178, -- 原基补给袋
	190610, -- 开悟长者的礼物
	191040, -- 圣墓宝物箱
	191041, -- 圣墓宝物箱
	191139, -- 开悟长者的礼物
	192438, -- 一箱宿命宝藏
	198863, -- 小型巨龙探险补给包
	198864, -- 大型马鲁克半人马补给袋
	198865, -- 大型巨龙探险补给包
	198866, -- 小型伊斯卡拉补给包
	198867, -- 大型伊斯卡拉补给包
	198868, -- 小型瓦德拉肯联军补给包
	198869, -- 大型瓦德拉肯联军补给包
	199192, -- 巨龙竞速者的钱袋
	199472, -- 满溢的巨龙探险补给包
	199473, -- 满溢的伊斯卡拉补给包
	199474, -- 满溢的马鲁克半人马补给袋
	199475, -- 满溢的瓦德拉肯联军补给包
	200069, -- 黑曜石宝箱
	200070, -- 黑曜保险箱
	200072, -- 灭龙要塞保险箱
	200073, -- 瓦德拉肯财宝
	200094, -- 商队保险箱
	200095, -- 装满补给的汤锅
	200468, -- 洪荒狩猎奖赏
	200513, -- 洪荒狩猎奖赏
	200515, -- 洪荒狩猎奖赏
	200516, -- 洪荒狩猎奖赏
	201462, -- 形状诡异的胃囊
	201754, -- 黑曜熔炉主管的宝箱
	201755, -- 黑曜熔炉主管的保险箱
	201756, -- 鼓囊囊的金币包
	201817, -- 暮光宝箱
	201818, -- 暮光保险箱
	202079, -- 牢窟珍宝箱
	202080, -- 牢窟珍宝箱
	202142, -- 灭龙要塞保险箱
	202171, -- 黑曜飞珑石
	202172, -- 满满一包钱币
	202371, -- 闪闪发光的拜荒者的宝箱
	203217, -- 龙鳞盈余箱
	203220, -- 伊斯卡拉盈余包
	203222, -- 马鲁克盈余包
	203224, -- 瓦德拉肯盈余箱
	203476, -- 拜荒者的宝箱
	203700, -- 破烂的礼盒
	204339, -- 一袋聚合混沌
	204359, -- 离岛竞速者的钱袋
	204378, -- 鼓囊囊的龙鳞探险队补给包
	204379, -- 鼓囊囊的伊斯卡拉补给包
	204380, -- 鼓囊囊的马鲁克半人马补给袋
	204381, -- 鼓囊囊的瓦德拉肯联军补给包
	204383, -- 奇物之袋
	204712, -- 鼓囊囊的峈姆鼹鼠人补给袋
	204721, -- 小型雏龙宝箱
	204722, -- 满溢的雏龙宝箱
	204723, -- 充裕的雏龙宝箱
	204724, -- 小型幼龙宝箱
	204725, -- 充裕的幼龙宝箱
	204726, -- 满溢的幼龙宝箱
	205226, -- 洞窟竞速者的钱袋
	205247, -- 叮当响的覆盖着污泥的袋子
	205248, -- 哐当响的覆盖着污泥的袋子
	205288, -- 埋藏的鼹鼠人收集品
	205346, -- 鼹鼠人秘密宝藏
	205347, -- 鼹鼠人收集的资源
	205367, -- 蒙恩的研究员的礼物
	205368, -- 感恩的研究员的礼物
	205369, -- 感激的研究员的礼物
	205370, -- 研究员的礼物
	205371, -- 感激的研究员讨取的货物
	205372, -- 蒙恩的研究员讨取的货物
	205373, -- 研究员讨取的货物
	205374, -- 感恩的研究员讨取的货物
	205423, -- 暗影烈焰残渣袋
	205964, -- 小型峈姆补给包
	205965, -- 大型峈姆补给包
	205966, -- 亚贝鲁斯珍宝箱
	205967, -- 亚贝鲁斯珍宝箱
	205968, -- 满溢的峈姆补给包
	205983, -- “闻”名遐迩的鼹鼠人宝藏
	206135, -- 英雄地下城探索者的战利品箱
	207002, -- 封装命运
	207582, -- 干涉现实之箱
	207583, -- 坍缩现实之箱
	207584, -- 易变现实之箱
	208090, -- 超因果贮藏
	208091, -- 时空扭曲珍宝箱
	208094, -- 时空扭曲珍宝箱
	208095, -- 时空扭曲珍宝箱
	208951, -- 超因果晶簇
	208952, -- 索莉多米的表扬信
	209037, -- 阿梅达希尔珍宝箱
	209837, -- 模糊的酣梦轻语
	209839, -- 真切的酣梦轻语
	210180, -- 翡翠飞珑石
	210217, -- 小份的幻梦奖赏
	210218, -- 饱满的幻梦奖赏
	210219, -- 巨量的幻梦奖赏
	210549, -- 梦境竞速者的钱袋
	210756, -- 一袋闪耀的幼龙的酣梦纹章
	210762, -- 一把闪光的魔龙的酣梦纹章
	210768, -- 一捧绚灿如花的守护巨龙的酣梦纹章
	210770, -- 一袋幼龙的酣梦纹章
	210780, -- 次级菲莱拉兹余烬
	210871, -- 强效菲莱拉兹余烬
	210872, -- 美梦挎包
	210917, -- 一袋雏龙的酣梦纹章
	210923, -- 一把魔龙的酣梦纹章
	210992, -- 满溢的梦境守望者宝库
	211303, -- 树妖补给袋
	211389, -- 盛放溢流宝藏箱
	211394, -- 丰收的梦境之种秘宝
	211410, -- 盛放野性宝箱
	211411, -- 萌芽梦境秘藏
	211413, -- 出苗梦境秘藏
	211414, -- 繁花梦境秘藏
	215362, -- 风暴宝箱
	215363, -- 余烬宝箱
	215364, -- 梦境宝箱
	217109, -- 觉醒风暴宝箱
	217110, -- 觉醒余烬宝箱
	217111, -- 觉醒梦境宝箱
	217242, -- 觉醒石翼
	217243, -- 觉醒红玉之翼
	217728, -- 觉醒珍宝箱
	-- TWW https://www.wowhead.com/items/miscellaneous?filter=11:166;1:11;0:0
	217011, -- 业余演员的宝箱
	217012, -- 新手演员的宝箱
	217013, -- 专业演员的宝箱
	218738, -- 奇形怪状的胃囊
	220767, -- 装满蚀刻先驱纹章的凯旋背包
	220773, -- 装满符文先驱纹章的庆祝礼包
	220776, -- 一簇辉煌的鎏金先驱纹章
	221268, -- 一袋风化先驱纹章
	221269, -- 猩红神勇石
	221373, -- 装满蚀刻先驱纹章的背包
	221375, -- 装满符文先驱纹章的礼包
	221502, -- 冒险者的战团绑定斗甲箱
	221503, -- 探索者的战团绑定斗甲箱
	224547, -- 时空扭曲之袋
	224556, -- 荣耀参赛者的保险箱
	224573, -- 晶化的协作包裹
	224721, -- 蜡封之盒
	224722, -- 共鸣水晶的蜡质包裹
	224723, -- 皮革的蜡质包裹
	224724, -- 魔尘的蜡质包裹
	224725, -- 草药的蜡质包裹
	224726, -- 岩石的蜡质之箱
	224784, -- 巅峰之箱
	225239, -- 满溢的多恩诺嘉尔议会宝库
	225245, -- 满溢的邃渊宝库
	225246, -- 满溢的陨圣峪宝库
	225247, -- 满溢的斩离之丝宝库
	225249, -- 叮当作响的金币袋
	225571, -- 纺丝者的酬谢
	225572, -- 将军的战争宝箱
	225573, -- 宰相的资金
	225896, -- 虚触神勇石
	226045, -- 将军的财宝
	226100, -- 宰相的财宝
	226103, -- 纺丝者的财宝
	226146, -- 一把嗡鸣的亮闪闪
	226147, -- 一批勇气岩石
	226148, -- 蜡封风化纹章
	226149, -- 一堆嗡鸣的亮闪闪
	226152, -- 蜡封纹章
	226154, -- 蜡封工匠纹章
	226193, -- 蛛魔宝物箱
	226194, -- 蛛魔宝物箱
	226195, -- 共鸣水晶簇
	226196, -- 丝绸刻基袋
	226198, -- 共鸣水晶团
	226199, -- 丝绸刻基包
	226256, -- 怀念者的印记
	226258, -- 地下堡行者的材料袋
	226259, -- 地下堡行者的共鸣水晶之袋
	226263, -- 剧团财宝
	226264, -- 光耀之箱
	226273, -- 觉醒的机械之箱
	226392, -- 粗心猛冲者的宝藏
	226813, -- 金色神勇石
	226814, -- 一箱黄金
	227450, -- 天穹竞速者的钱袋
	227713, -- 工匠商盟支出
	227792, -- 素日宝箱
	228361, -- 干练冒险者的宝箱
	228741, -- 燃灯者补给袋
	228916, -- 阿加裁缝的背包
	228917, -- 一包矿石
	228919, -- 阿加草药背包
	228931, -- 阿加附魔师的背包
	228932, -- 阿加工程师的背包
	228933, -- 阿加制皮匠的背包
	228959, -- 一堆尚未识别的肉块
	229005, -- 一箱土灵宝藏
	229006, -- 一箱土灵宝藏
	229129, -- 一箱地下堡行者的宝藏
	229130, -- 一箱地下堡行者的宝藏
	230032, -- 满溢的卡雷什托拉斯宝库
	230722, -- 星界装备箱
	230724, -- 星界珠宝师的底座
	232076, -- 冒险者的战团绑定斗甲箱
	232372, -- 逝往财富之箱
	232382, -- 金色神勇石
	232463, -- 满溢的安德麦宝库
	232465, -- 暗索宝库
	232471, -- 黑铁宝物箱
	232472, -- 黑铁宝物箱
	232473, -- 黑铁宝物箱
	232791, -- 征服勋章
	233276, -- 地下堡行者新手包
	233281, -- 地下堡行者的装饰品福袋
	233557, -- 筛过的废料堆
	233558, -- S.C.R.A.P.豪华清洁器
	234425, -- 被遗忘的对开纸
	234729, -- 安德麦宝物箱
	234731, -- 安德麦宝物箱
	234743, -- 热砂的宝库
	234744, -- 黑水的宝库
	234745, -- 锈水的宝库
	234746, -- 风险投资公司的宝库
	234816, -- 满满一袋铁材
	235052, -- 风化的神秘背包
	235054, -- 完好的神秘背包
	235151, -- 杰出演员的宝箱
	235258, -- 锈水的宝库
	235259, -- 锈水的宝库
	235260, -- 黑水的宝库
	235261, -- 黑水的宝库
	235262, -- 热砂的宝库
	235263, -- 热砂的宝库
	235264, -- 风险投资公司的宝库
	235265, -- 风险投资公司的宝库
	235548, -- 土灵旱鸭子的箱子
	235558, -- 一箱暗索杂物
	235610, -- 干练冒险者的宝箱
	235639, -- 干练冒险者的宝箱
	235911, -- 风化的神秘背包
	236756, -- 社会期望打赏箱
	236757, -- 慷慨打赏箱
	236758, -- 豪奢打赏箱
	236944, -- 风化的神秘背包
	236953, -- 猩红神勇石
	236954, -- 虚触神勇石
	237132, -- 锈水宝库
	237133, -- 风险投资公司宝库
	237134, -- 热砂宝库
	237135, -- 黑水宝库
	237743, -- 阿拉希士兵的宝匣
	237759, -- 阿拉希教士的宝箱
	237760, -- 阿拉希勇士的战利品
	238207, -- 奶奶的峰时红利
	238208, -- 奶奶的峰时红利
	239004, -- 光耀服役包
	239118, -- 巅峰之箱
	239120, -- 干练冒险者的宝箱
	239121, -- 觉醒的机械之箱
	239122, -- 将军的战争宝箱
	239124, -- 宰相的资金
	239125, -- 纺丝者的酬谢
	239126, -- 光耀之箱
	239128, -- 剧团财宝
	239489, -- 光耀军官的宝箱
	239546, -- 没收的密教徒背包
	240926, -- 装满符文虚灵纹章的礼包
	240927, -- 装满蚀刻虚灵纹章的背包
	240928, -- 一袋风化虚灵纹章
	240929, -- 一簇辉煌的鎏金虚灵纹章
	240930, -- 装满符文虚灵纹章的庆祝礼包
	240931, -- 装满蚀刻虚灵纹章的凯旋背包
	242386, -- 游学者的纪念品收藏箱
	244140, -- 虚灵飘带箱
	244335, -- 卡雷什神勇石箱
	244336, -- 卡雷什共鸣水晶箱
	244466, -- 达格兰的残片袋
	244696, -- 过载的宝箱
	244842, -- 载誉老兵的宝箱
	244865, -- 巅峰之箱
	244883, -- 干练安德麦冒险者的宝箱
	245280, -- 干练卡兹阿加冒险者的宝箱
	245589, -- 地狱召唤者宝箱
	245611, -- 扭动的巅峰之箱
	245653, -- 宝匣钥匙碎片
	247820, -- 一箱卡雷什宝藏
	247821, -- 一箱卡雷什宝藏
	248126, -- 地下堡行者新手包
	248127, -- 地下堡行者的装饰品福袋
	248410, -- 科技巫师的馈赠
	250763, -- 剧团财宝
	250764, -- 奶奶的峰时红利
	250765, -- 觉醒的机械之箱
	250766, -- 光耀之箱
	250767, -- 将军的战争宝箱
	250768, -- 宰相的资金
	250769, -- 纺丝者的酬谢
	250975, -- 地狱召唤者宝箱
	255676, -- 相位潜者的箱子
	-- Legion Remix https://www.wowhead.com/items/miscellaneous?filter=11:166:82;1:11:2;0:0:110205
	237812, -- 永恒珍宝箱
	239224, -- 永恒珍宝箱
	239303, -- 永恒珍宝箱
	242617, -- 奇异的幻影
	243373, -- 时空奔行者的武器
	244457, -- 钥石箱
	245553, -- 英雄永恒珍宝箱
	245925, -- 神器魔沙
	246812, -- 初级青铜宝盒
	246813, -- 高级青铜宝盒
	246814, -- 青铜宝盒
	246815, -- 次级青铜宝盒
	246936, -- 共鸣的纪元纪念品
	246937, -- 完美的纪元纪念品
	248247, -- 永恒威能宝箱
	249780, -- 圣光军团勇士的徽章
	249781, -- 守望者勇士的徽章
	249782, -- 瓦拉加尔勇士的徽章
	249783, -- 堕夜精灵勇士的徽章
	249784, -- 抗魔联军勇士的徽章
	249785, -- 高岭部族勇士的徽章
	249786, -- 织梦者勇士的徽章
	249787, -- 法罗迪斯宫廷勇士的徽章
	249788, -- 阿古斯防卫军勇士的徽章
	249891, -- 神器魔沙堆
	251821, -- 永恒威能宝箱
	253224, -- 破碎时间的微粒
	254267, -- 粉碎的纪元挑战纪念品
	254847, -- 初级青铜宝盒
	254848, -- 初级青铜宝盒
	254849, -- 初级青铜宝盒
	254850, -- 初级青铜宝盒
	256763, -- 永恒军械库宝箱
}

local professionItems = {
	-- https://www.wowhead.com/items/miscellaneous/other?filter=166:98:111;11:1:2;0:0:1
	-- https://www.wowhead.com/items/miscellaneous/other?filter=107;0;increase+your+Khaz+Algar
	213779, -- 阿加琥珀棱镜 (1)
	213780, -- 阿加琥珀棱镜 (2)
	213781, -- 阿加琥珀棱镜 (3)
	222546, -- 炼金阿加论述
	222547, -- 裁缝阿加论述
	222548, -- 铭文阿加论述
	222549, -- 制皮阿加论述
	222550, -- 附魔阿加论述
	222551, -- 珠宝加工阿加论述
	222552, -- 草药学阿加论述
	222553, -- 采矿阿加论述
	222554, -- 锻造阿加论述
	222621, -- 工程学阿加论述
	222649, -- 剥皮阿加论述
	224007, -- 《残留躯壳用途（如何拆分）》
	224023, -- 《草药防腐工艺》
	224024, -- 《身体转化论》第8章
	224036, -- 《谢幕丝网！》
	224038, -- 《后萨隆邪铁时代的熔炼》
	224050, -- 丝网火花：英姿动人
	224052, -- 《时钟、齿轮、链轮和长腿》
	224053, -- 《防御敌对符文八法》
	224054, -- 《地表居民的新兴水晶》
	224055, -- 《坚石起步》
	224056, -- 《残留躯壳用途（拆分后怎么办）》
	224264, -- 深林花瓣
	224265, -- 深林玫瑰
	224583, -- 板岩之石
	224584, -- 因侵蚀而抛光的板岩
	224645, -- 镶嵌珠宝的炼金笔记
	224647, -- 镶嵌珠宝的锻造笔记
	224648, -- 镶嵌珠宝的裁缝笔记
	224651, -- 机械习得的采矿笔记
	224652, -- 镶嵌珠宝的附魔笔记
	224653, -- 机械习得的工程学笔记
	224654, -- 机械习得的铭文笔记
	224655, -- 被虚空照亮的珠宝加工笔记
	224656, -- 被虚空照亮的草药学笔记
	224657, -- 被虚空照亮的剥皮笔记
	224658, -- 被虚空照亮的制皮笔记
	224780, -- 韧化的风暴毛皮
	224781, -- 深渊毛皮
	224782, -- 锋利之爪
	224807, -- 阿加剥皮师笔记
	224817, -- 阿加草药师笔记
	224818, -- 阿加矿工笔记
	224835, -- 深林根须
	224838, -- 虚无裂片
	225220, -- 几丁质骨针
	225221, -- 网纹纺锤
	225222, -- 石革样品
	225223, -- 坚固蛛魔甲壳
	225224, -- 透光宝石碎块
	225225, -- 深海之石碎片
	225226, -- 条纹墨石
	225227, -- 蜡封记录
	225228, -- 被锈蚀封住的机关
	225229, -- 土灵感应线圈
	225230, -- 晶化储存器
	225231, -- 粉尘之耀
	225232, -- 心核隧途坯料
	225233, -- 致密刀石
	225234, -- 炼金沉淀物
	225235, -- 深石熔炉
	226265, -- 土灵铁粉
	226266, -- 金属多恩诺嘉尔框架
	226267, -- 加固烧杯
	226268, -- 刻文搅棒
	226269, -- 化学家的纯净之水
	226270, -- 圣化研钵与研杵
	226271, -- 蛛魔混调之盐
	226272, -- 黑暗药剂师之瓶
	226276, -- 远古土灵铁砧
	226277, -- 多恩诺嘉尔之锤
	226278, -- 喧鸣锤钳
	226279, -- 土灵凿子
	226280, -- 神圣烈焰熔炉
	226281, -- 光耀钳子
	226282, -- 蛛魔铁匠修理包
	226283, -- 小蜘蛛的钢丝刷
	226284, -- 碾碎的土灵宝石
	226285, -- 银白多恩诺嘉尔魔棒
	226286, -- 落满煤灰的宝珠
	226287, -- 活化附魔之尘
	226288, -- 神圣之火精华
	226289, -- 附魔阿拉希卷轴
	226290, -- 黑暗魔法之书
	226291, -- 虚空裂片
	226292, -- 岩石工程师的扳手
	226293, -- 多恩诺嘉尔眼镜
	226294, -- 失能的采矿炸弹
	226295, -- 土灵构造体蓝图
	226296, -- 神圣哑炮
	226297, -- 阿拉希安全手套
	226298, -- 被操控的机械蜘蛛
	226299, -- 耗尽的毒液罐
	226300, -- 上古之花
	226301, -- 多恩诺嘉尔园艺镰刀
	226302, -- 土灵掘土叉
	226303, -- 真菌人切分者的小刀
	226304, -- 阿拉希花园泥铲
	226305, -- 阿拉希草药修枝剪
	226306, -- 缠根莲花
	226307, -- 掘地工的铁铲
	226308, -- 多恩诺嘉尔抄写员的羽毛笔
	226309, -- 历史学家的蘸水笔
	226310, -- 符文卷轴
	226311, -- 蓝色土灵颜料
	226312, -- 告密者的自来水笔
	226313, -- 书法家的轮廓分明的记号笔
	226314, -- 蛛魔文本
	226315, -- 制毒师的墨水瓶
	226316, -- 轻柔珠宝锤
	226317, -- 土灵宝石老虎钳
	226318, -- 雕纹石质档案
	226319, -- 珠宝匠的精细钻头
	226320, -- 阿拉希尺寸量规
	226321, -- 图书馆员的放大镜
	226322, -- 仪式祭师的水晶
	226323, -- 蛛魔工作台垫块
	226324, -- 土灵穿线工具
	226325, -- 多恩诺嘉尔匠人的平刀
	226326, -- 地下抛光膏
	226327, -- 土灵尖钻
	226328, -- 阿拉希倒角工具套装
	226329, -- 阿拉希皮革磨光器
	226330, -- 蛛魔鞣制棒
	226331, -- 弯曲的蛛魔剥皮刀
	226332, -- 土灵矿工的木槌
	226333, -- 多恩诺嘉尔凿子
	226334, -- 土灵开凿者的铲子
	226335, -- 再生矿石
	226336, -- 阿拉希精准钻头
	226337, -- 热诚考古学家的挖掘铲
	226338, -- 沉重的蜘蛛碾压器
	226339, -- 蛛魔采矿补给
	226340, -- 多恩诺嘉尔切刀
	226341, -- 土灵工人的横梁
	226342, -- 匠人的制图刮刀
	226343, -- 真菌人的丰富鞣酸
	226344, -- 阿拉希鞣制剂
	226345, -- 阿拉希工匠的辐刨
	226346, -- 蛛魔的压光铁
	226347, -- 甲壳抛光器
	226348, -- 多恩诺嘉尔拆线刀
	226349, -- 土灵卷尺
	226350, -- 符文土灵别针
	226351, -- 土灵缝纫者的剪子
	226352, -- 阿拉希旋转切割器
	226353, -- 皇家服饰商的角度尺
	226354, -- 蛛魔被褥
	226355, -- 蛛魔针垫
	227407, -- 消隐铁匠的图表
	227408, -- 消隐铭文师的符文图案
	227409, -- 消隐炼金师的研究
	227410, -- 消隐裁缝的图表
	227411, -- 消隐附魔师的研究
	227412, -- 消隐工程师的草稿
	227413, -- 消隐珠宝匠的插图
	227414, -- 消隐制皮匠的图表
	227415, -- 消隐草药师的笔记
	227416, -- 消隐矿工的笔记
	227417, -- 消隐剥皮师的笔记
	227418, -- 杰出铁匠的图表
	227419, -- 杰出铭文师的符文图案
	227420, -- 杰出炼金师的研究
	227421, -- 杰出裁缝的图表
	227422, -- 杰出附魔师的研究
	227423, -- 杰出工程师的草稿
	227424, -- 杰出珠宝匠的插图
	227425, -- 杰出制皮匠的图表
	227426, -- 杰出草药师的笔记
	227427, -- 杰出矿工的笔记
	227428, -- 杰出剥皮师的笔记
	227429, -- 无瑕铁匠的图表
	227430, -- 无瑕铭文师的符文图案
	227431, -- 无瑕炼金师的研究
	227432, -- 无瑕裁缝的图表
	227433, -- 无瑕附魔师的研究
	227434, -- 无瑕工程师的草稿
	227435, -- 无瑕珠宝匠的插图
	227436, -- 无瑕制皮匠的图表
	227437, -- 无瑕草药师的笔记
	227438, -- 无瑕矿工的笔记
	227439, -- 无瑕剥皮师的笔记
	227659, -- 瞬息奥术具象
	227661, -- 流光陆生水晶
	227662, -- 荧光粉
	227667, -- 阿加附魔师对开纸
	228724, -- 炼金知识烁光
	228725, -- 炼金知识闪光
	228726, -- 锻造知识烁光
	228727, -- 锻造知识闪光
	228728, -- 附魔知识烁光
	228729, -- 附魔知识闪光
	228730, -- 工程学知识烁光
	228731, -- 工程学知识闪光
	228732, -- 铭文知识烁光
	228733, -- 铭文知识闪光
	228734, -- 珠宝加工知识烁光
	228735, -- 珠宝加工知识闪光
	228736, -- 制皮知识烁光
	228737, -- 制皮知识闪光
	228738, -- 裁缝知识烁光
	228739, -- 裁缝知识闪光
	228773, -- 阿加炼金师的笔记本
	228774, -- 阿加铁匠日志
	228775, -- 阿加工程师的记事本
	228776, -- 阿加铭文师日志
	228777, -- 阿加珠宝匠的笔记本
	228778, -- 阿加制皮匠日志
	228779, -- 阿加裁缝的笔记本
	235855, -- 虚灵裁缝知识著作
	235856, -- 虚灵剥皮知识著作
	235857, -- 虚灵采矿知识著作
	235858, -- 虚灵制皮知识著作
	235859, -- 虚灵珠宝加工知识著作
	235860, -- 虚灵铭文知识著作
	235861, -- 虚灵草药学知识著作
	235862, -- 虚灵工程学知识著作
	235863, -- 虚灵附魔知识著作
	235864, -- 虚灵锻造知识著作
	235865, -- 虚灵炼金知识著作
}

local bigDig = {
	205223, -- 繁饰半人马之斧
	211414, -- 繁花梦境秘藏
	212650, -- 纹身墨水罐
	212687, -- 粗制玩具鸭鸭
	212762, -- 黯淡的角戒
	212769, -- 破烂的通缉布告
	212773, -- 锈蚀的项坠
	212976, -- 龙人鸭子雕像
	212977, -- 龙人标牌
	212978, -- 巨龙画匠的调色板
	213020, -- 远古龙人铁铲
	213021, -- 塞住的龙人之瓶
	213022, -- 龙人铁匠锤
	213023, -- 浸油的贾拉丁火炬
	213024, -- 带血痕的贾拉丁杯子
	213025, -- 远古贾拉丁弩箭
	213175, -- 蒙尘的贾拉丁书典
	213176, -- 保存完好的群岛书典
	213177, -- 无垢书典
	213183, -- 临时制作的串珠手链
	213185, -- 蒙尘的半人马书典
	213186, -- 蒙尘的鼹鼠人书典
	213187, -- 蒙尘的龙人书典
	213188, -- 蒙尘的龙希尔书典
	213189, -- 保存完好的龙裔书典
	213190, -- 保存完好的贾拉丁书典
	213192, -- 被划掉的人名列表
	213200, -- 占星术之书
	213204, -- 镶嵌着红宝石的项坠
	213208, -- 一罐腌制的凤尾酪鱼
	213215, -- 雕刻的献纳之石
	213357, -- 水晶占卜之碗
	213359, -- 开裂的龙人法杖
	213365, -- 雕琢的洞穴水晶
	213375, -- 一包埋藏的宝贝
	213382, -- 半张半人马狩猎地图
	213389, -- 古代半人马日记
	213429, -- 一丝不苟的档案员的附录
}

local delveItem = {
	-- 11.0
	218129, -- 陶瓷箭簇神像
	225897, -- 蛮力神像
	225898, -- 大地母亲神像
	225899, -- 牢不可破的铁质神像
	225900, -- 光触神像
	225901, -- 流线轮廓圣物
	225902, -- 终愿神像
	225903, -- 流变圣物
	225904, -- 迷时圣物
	225905, -- 古旧探求者圣物
	225906, -- 无命通灵圣物
	225907, -- 知觉圣物
	225908, -- 泽克维尔的残血
	227784, -- 地下堡行者的奖赏
	228582, -- 流线轮廓圣物
	228984, -- 牢不可破的铁质神像
	229353, -- 盈怒神像
	-- 11.1
	230225, -- 卡亚可乐运载器
	230226, -- 三维生物打印机
	230227, -- 地精磁力弹跳榴弹
	230228, -- 口袋工厂
	230229, -- 冲击力转化矩阵
	230230, -- 战利品雷达
	230231, -- 逆向工程的地精死亡炸弹
	230232, -- 滑稽的巨大磁铁
	230233, -- 生物燃料火箭装置
	230234, -- 标记的强化芯片
	230950, -- 过载晶塔
	233071, -- 地下堡行者的奖赏
	233205, -- 迈动饮料
	233792, -- 地下堡行者的伪装
	234013, -- 和平主义者武装平台
	234014, -- 自动化足球炸弹分发器
	234015, -- 机甲暴龙简易拼装包
	-- 11.2
	239567, -- 顺风导体
	239568, -- 音频增幅水晶
	239569, -- 破损的徽盾
	239570, -- 时间缓速水晶
	239571, -- 卡雷什之沙
	239573, -- 虚灵能量转化器
	239576, -- 法力色泽的眼镜
	239578, -- 莫名其妙的装置
	239579, -- 回力帽子
	239580, -- 虚空嵌套矩阵
	248017, -- 尖啸石英
	248142, -- 地下堡行者的奖赏
	248755, -- 罐装星辰
	248764, -- 精工闪现陷阱
	248954, -- 虚空扭曲之种
}

local seeds = {
	-- from MerathilisUI
	208047, -- 硕大的梦境之种
	208066, -- 小小的梦境之种
	208067, -- 饱满的梦境之种
	211947, -- 收获之种补给
	214561, -- 翠绿之种
	214605, -- 晶化翠绿之种
}

local holidayRewards = {
	17726, -- 烟林牧场特殊礼物
	21746, -- 红包
	37586, -- 一把糖果
	54536, -- 结冰的袋子
	54537, -- 心型护匣
	116762, -- 被窃的礼物
	117392, -- 塞满战利品的南瓜
	117393, -- 桶型宝箱
	117394, -- 结冰的袋子
	147907, -- 心形纸盒
	149503, -- 失窃的礼物
	149574, -- 装满战利品的南瓜
	209024, -- 塞满战利品的南瓜
	216874, -- 塞满战利品的篮子
	223619, -- 青铜庆典百宝袋
	223620, -- 二十周年宝匣
	223621, -- 二十周年宝匣
	226101, -- 克罗米的观光百宝袋
	226102, -- 克罗米的观光百宝袋
	229355, -- 克罗米的高级百宝袋
	229359, -- 克罗米的百宝袋
	232598, -- 一袋时空扭曲徽章
	232877, -- 时空百宝袋
	233014, -- 青铜庆典宝物箱
	235505, -- 一包时空扭曲徽章
	243291, -- 一包美酒节商品
	243292, -- 一包美酒节商品
	243293, -- 一包美酒节商品
}

local function createList(base, ...)
	local list = {}
	for _, key in pairs({ ... }) do
		local items = base[key]
		for _, item in pairs(items) do
			list[item] = true
		end
	end
	local sorted = {}
	for item in pairs(list) do
		tinsert(sorted, item)
	end
	sort(sorted)
	return sorted
end

EB.moduleList = {
	["POTION"] = createList(potions, "general", "legacy", "sl", "df", "tww"),
	["POTIONSL"] = createList(potions, "general", "sl"),
	["POTIONDF"] = createList(potions, "general", "df"),
	["POTIONTWW"] = createList(potions, "general", "tww"),
	["FLASK"] = createList(flasks, "legacy", "sl", "df", "tww"),
	["FLASKSL"] = createList(flasks, "sl"),
	["FLASKDF"] = createList(flasks, "df"),
	["FLASKTWW"] = createList(flasks, "tww"),
	["RUNE"] = createList(runes, "df", "tww"),
	["RUNEDF"] = createList(runes, "df"),
	["RUNETWW"] = createList(runes, "tww"),
	["VANTUS"] = createList(vantus, "df", "tww"),
	["VANTUSTWW"] = createList(vantus, "tww"),
	["FOOD"] = createList(foods, "crafted_sl", "crafted_df", "crafted_tww"),
	["FOODSL"] = createList(foods, "crafted_sl"),
	["FOODDF"] = createList(foods, "crafted_df"),
	["FOODTWW"] = createList(foods, "crafted_tww"),
	["FOODVENDOR"] = createList(foods, "vendor"),
	["MAGEFOOD"] = createList(foods, "mage"),
	["FISHING"] = createList(fishings, "general", "tww"),
	["FISHINGTWW"] = createList(fishings, "tww"),
	["BANNER"] = banners,
	["UTILITY"] = utilities,
	["OPENABLE"] = openableItems,
	["PROF"] = professionItems,
	["SEEDS"] = seeds,
	["BIGDIG"] = bigDig,
	["DELVE"] = delveItem,
	["HOLIDAY"] = holidayRewards,
}
